{"Mar 11, 2025, 9:59 PMUpdated 17 days ago": ["A rally took place outside Delaney Hall in Newark on Tuesday. Demonstrators are protesting the opening of what will become the largest immigrant detention center on the East Coast.", "Immigrations and Customs Enforcement announced last month its plans to reopen the facility under a contract with the private company The GEO Group.", "Activists, families affected by mass deportations and elected officials all spoke at the rally, including Newark Mayor Ras Baraka.", " ", "Baraka, who is running for governor of New Jersey, said that he has been against the detention center from the beginning.", "“They believe they can come here and open up. They have been very brazen and very arrogant,” the mayor said. “[They] have not taken out one permit. Have not gotten one inspection…have not done anything. They believe that they’re gonna open up and we’re saying, ‘You’re not gonna open up here in the city of Newark.\"", "A similar battle has played out in the city of Elizabeth, where the state tried to close a private immigration jail by appealing a judge’s decision to keep it open."]}
{"Mar 5, 2025, 10:42 PMUpdated 23 days ago": ["The Integrated Refugee and Immigrant Services, also known as ", ", announced Wednesday it will be closing its New Haven location.", "The office, located on 235 Nicoll St., will close by April 30.", "The nonprofit has an office in Hartford, according to its website.", "According to a statement, the closure is due to the sudden federal funding reductions to the nonprofit's critical client-serving programs. As a result, the nonprofit had to make what they describe as cost-saving decisions, which include reducing operational expenses.", "Despite the closure, Maggie Mitchell-Salem, IRIS's executive director, says the nonprofit is committed to providing essential services to refugees and immigrants.", "In a statement, Sen. Richard Blumenthal said the following, \"These cuts at IRIS are heartbreaking — reflecting the cruel, reckless slash and burn of federal funding that simply makes resettlement of lawful immigrants more difficult. No matter what is happening around the world or in our own country, IRIS opens its arms to people fleeing persecution, famine, and violence to help them find a safe home in Connecticut. That work has been lifesaving for thousands of refugee and immigrant families, and it's despicable that IRIS is forced to make these cuts to fund Trump's tax breaks for billionaires. IRIS will undoubtedly keep fighting to provide a safe haven for refugees and immigrants, and I vow to be with them every step of the way.\""]}
{"Mar 3, 2025, 10:39 PMUpdated 25 days ago": ["A rally in Elizabeth follows recent ICE raids and the announcement about a new immigration detention facility set to open this year.", "Activists have been protesting the conditions at the Elizabeth Detention Center and calling for it to close. Now they're facing the Delaney Hall facility in Newark that is set to reopen as an immigrant detention center.", "Activists say those being kept at EDC, owned by CoreCivic are suffering inhumane conditions with overcrowding. They say the prison, which has space for about 250, is housing about 350.", "\"We were told there was a period of time when there wasn't drinking water accessible, that people were surviving just eating bread,\" said Li Adorno, with Movimiento Cosecha.", " ", "Advocates for immigrants say opening another detention center means it will only be filled with even more prisoners. Plans to ", "as a 1,000-bed immigration detention center came after private corporation GEO Group signed a 15-year contract with ICE.", "\"There’s no need for any ICE detention. People can continue their immigration case outside without being incarcerated,\" said Haydi Torres, with Cosecha New Jersey.", "According to ICE, \"The facility will expand ICE’s detention capacity in the northeast, enhancing the agency’s ability to manage the region’s growing enforcement and removal operations.\"", "Local organizations are asking lawmakers to help get the Immigration Trust Act signed to make it easier for immigrants to seek help, regardless of their status."]}
{"Mar 19, 2025, 8:51 PMUpdated 10 days ago": ["Emotions ran high in Hartford as undocumented migrants and Republican lawmakers clashed over immigration enforcement on Wednesday.", "Hundreds weighed in on two competing bills.", "One would make it easier for police to work with Immigration and Customs Enforcement agents, while the other would make it harder.", "The debate comes as the Trump administration ramps up immigration raids – even deporting a plane load of migrants on Saturday despite a judge’s verbal order.", "“The people of this country mandated President Trump to deal with the border crisis, deal with illegal immigration, deal with illegal alien crime,” said White House border czar Tom Homan. “And that’s exactly what we’re doing.”", "On Wednesday, immigrant advocates urged state lawmakers to strengthen the TRUST Act, which generally bans police from sharing information with ICE unless suspects are convicted felons or unless agents have a warrant signed by a judge.", "“We are part of the backbone of this state, and yet we continue to live in fear that a simple traffic stop or police encounter could destroy our lives,” said Tabitha Sookdeo, executive director of Connecticut Students For A Dream.", "Immigration authorities are already notified when a suspect is arrested because their fingerprints are entered into a national FBI database.", "But ICE has complained that Connecticut police agencies release suspects before agents can pick them up, forcing them to arrest people on the street.", "A new bill would expand the TRUST Act to include state and local government workers, prosecutors and the parole board. They could not disclose an person's address, school, workplace or any appointments and hearings they have scheduled.", "One woman claimed that the Connecticut Department of Motor Vehicles called federal agents on her husband.", "“They told him his green card was rejected and that they had to send the information to ICE, and that he could not get a new license until ICE accepted his renewal,” Arlene Angel said through a translator.", "The bill would also ban Connecticut agencies from using interpreters from ICE. The changes would take effect Oct. 1.", "Several groups said the proposal doesn’t go far enough.", "They called for a ban on immigration arrests around courthouses and police sharing surveillance footage with ICE.", "“We want them out of our courthouses. We want them out of our schools,” said Kica Matos, executive director of the National Immigration Law Center. “We want them out of our hospitals. We want them out of the state.”", "Last month, state lawmakers passed a ", " on ICE visits to schools. Agents now need a judicial warrant to come inside.", "Republican lawmakers are pushing an alternative bill that would allow more ", ". Police could hold a suspects charged with Class A, B or C felonies with just an administrative warrant.", "“We worked with state police, local police, sometimes the Secret Service, sometimes the FBI,” said state Rep. Pat Callahan (R-New Fairfield). “But then, come 2013, we were told we could no longer work with one agency – ICE.”", "Some town leaders worried about having to choose between following state law and federal law.", "“The State has never asked me to do anything illegal, [but] I feel the HB 7212 is putting State Employees at risk by hinder ICE carrying out Federal Law Enforcement Activities,” Scotland First Selectman Dana Barrow ", ". “This bill puts State Employees at risk but also puts State residents at risk by harboring Illegal Aliens.”", "Democrats countered that the TRUST Act improves public safety.", "“When people fear calling the police because they think they’ll be turned over to ICE, real criminals get away,” said state Sen. Gary Winfield (D-New Haven), co-chair of the Legislature's Judiciary Committee. ", "The Judiciary Committee has until April 11 to act on the bills.", "To submit written testimony, click ", "."]}
{"Feb 24, 2025, 10:55 PMUpdated 32 days ago": ["The Department of Homeland Security has revoked", "The extension put in place by the Biden administration will now end this August.", "It's said that up to half a million Haitians living in the U.S. may be impacted by this change. ", ". ", "News 12 spoke with a woman who was granted TPS at Konbit Neg Lakay, a resource for immigrants in the Village of Spring Valley where there is a large Haitian community. ", "Through a translator, she said that she has been in the US for a year and a half.", "She wishes the Trump administration had taken steps to make Haiti a more safe place before making the change.", "The country has been in turmoil for years. ", "\"The American government doesn't care about Haitian life,\" said Jean David Julien reacting to the cancellation as someone who came to the country through humanitarian parole and has applied for TPS and asylum status. \"If a friend comes to your home and you said, 'OK. It's time. Go back to your home.' even if you know, in the world, something like awful can happen to your friend. I cannot consider you as a friend.\"", "DHS removed temporary protection status extension for Venezuelans. "]}
{"Feb 24, 2025, 10:43 AMUpdated 33 days ago": ["Mayor Eric Adams has announced that the Roosevelt Hotel will be closing soon.", "The hotel has been used as a centralized intake center for newly arriving asylum seekers.", "The facility opened in May 2023 during the heights of the international asylum seeker crisis when the city was receiving an average of 4,000 arrivals each week.", "The city says the site provided support to migrants such as legal assistance, medical care and reconnection services.", "The shelter is one of 53 other emergency shelters set to close by June."]}
{"Mar 10, 2025, 8:53 PMUpdated 18 days ago": ["Saying the need was “compelling,” Gov. Ned Lamont visited a Bridgeport immigration agency to tout nearly $3 million in emergency funds for groups targeted by the Trump administration.", "Republican critics called the money an unvetted “giveaway” to Lamont’s political allies.", "Susan Schnitzer is nervous. She heads the Connecticut Institute for Refugees and Immigrants in Bridgeport, which isn’t sure if it will receive any money from Washington this year.", "“We were expecting more of what happened the last time this administration was in place – that it would kind of be a slow – a slow decline,” she said. “Not really the hatchet job that’s happening.”", "CIRI is one of a small handful of agencies in Connecticut that resettles refugees in Connecticut. The White House already canceled that contract in January, and it’s unclear what other funding is at risk.", "“It’s heartbreaking,” Schnitzer said.", "Lamont chose CIRI to host a ceremonial bill signing for $2.8 million headed for immigration and LQBTQ+ groups, as well as Planned Parenthood of Southern New England.", "Nearly half a million dollars is going to CIRI, the Connecticut Immigrant and Refugee Coalition and IRIS – which is ", " its New Haven office due to $4 million in funding cuts. ", "Gay and transgender rights groups are getting $1 million, including the Bridgeport and New Haven Pride Centers and Triangle Community Center in Norwalk.", "“We are seeing the federal government target the most marginalized among us,” said Rachel Simon, the center’s executive director.", "Simon said part of the funding will help patients from other states receive gender transition services in Connecticut. ", "Planned Parenthood is receiving $800,000.", "Republicans called it a giveaway to Lamont’s political allies.", "“None of these organizations were vetted. None of these people submit, you know, their budgets to us,” said Connecticut House GOP leader Vin Candelora (R-North Branford) last Wednesday. “So it’s a giveaway.”", "Lamont shot back Monday.", "“Planned Parenthood is not a political ally,” the governor said. “Planned Parenthood is fighting for women’s rights. I think that’s a bipartisan issue.”", "Monday’s bill signing was quite an about-face for Lamont.", "One week earlier, he vetoed the funding – arguing that the state can’t bail out every group targeted by the administration.", "“These are 12 worthy not-for-profits – 15 – that said, ‘I’m getting hammered by Donald Trump’s DOGE [Department of Government Efficiency] cuts. I need help,’” Lamont said last Monday. “You’re going to have 12 more come up every week for the next six weeks.”", "But now, the governor sees things differently.", "“We have to take each circumstance as it comes up,” Lamont told reporters. “I thought this – given the timing, given the urgency – was so compelling that we wanted to do something. We wanted to do it in a fiscally responsible way.\"", "Lamont reached a deal to move the spending outside the state budget after lawmakers threatened to override his veto. The governor also signed ", "Republicans slammed Lamont’s change of heart.", "“I have never seen a governor in my life veto a bill and within three hours, change his mind and cut a deal that does the exact same thing we voted on last week – but it violates the principles of the fiscal guardrails that we put in place,” Candelora said.", "Connecticut’s three largest immigration agencies are asking for $3 million in the next state budget.", "Schnitzer said the money CIRI gets pays for itself. ", "“There’s more money going back into the state, because people are paying taxes,” she said. “People are purchasing things and utilizing usually local markets.” ", "In an average year, Schnitzer said that CIRI takes 5,000 immigrants. Many have become teachers and nurses, she said."]}
{"Feb 24, 2025, 4:04 AMUpdated 33 days ago": ["Men began the move Sunday night into a new migrant shelter in Mott Haven.\n\n\tThe shelter on the corner of East 141st Street and Bruckner Boulevard has the capacity to house 2,200 people.\n\n\tA News 12 crew observed several men with rolling suitcases and duffle bags.\n\n\t“[On Saturday] I came here,” said Hamidou Balde, who had his new shelter identification and lanyard around his neck.\n\n\tThe 35-year-old said he had been staying at other city shelters since he arrived in the United States from Africa in 2023.\n\n\t“I look for work,” said Balde, who told News 12 he had proper documents but is currently unemployed. “I [don’t] have work.”\n\n\tWhile window shades were drawn on the upper floors, part of the first floor appeared to still be under renovation.\n\n\tAnother part of the first floor, where the men were entering Sunday, holds a security checkpoint and metal detectors.\n\n\tThe new center has been a center of controversy in recent months and caused outrage from some local lawmakers and residents.\n\n\t“It’s not that I don’t want anybody to have somewhere to live,” said Sonia Taylor, of Mott Haven. “It’s the location where you’re putting them.”\n\n\tThe movement of men into the shelter comes after Mayor Edic Adams’ office announced a total of 46 migrant shelters will be closed by June.\n\n\t“It’s the Bronx, it’s over here now,” Taylor said. “You just changed the location. It seems like everything that you’re closing down, that you don’t think should be somewhere, you’re putting it here. It’s not fair really.”\n\n\tNews 12 reached out to Adams’ office and Bronx Borough President Vanessa Gibson’s office about the opening of the shelter but had not responded as of Sunday night."]}
{" and Feb 21, 2025, 9:33 AMUpdated 35 days ago": ["Women were apparently sex trafficked throughout Nassau County, and now a Queens man, who officials say is in the country illegally, is facing charges.", "Jorge Ramos, 55, pleaded not guilty at arraignment Friday to multiple sex trafficking and prostitution charges.", "Ramos is accused of taking his victims to hotels in Nassau County, including the Hyatt Place in Garden City and Marriott in Uniondale, rent hotel rooms and collect a portion of the money in exchange for prostitution, according to court paperwork.", "Anyone who believes they may have been a victim is being asked to contact police.\n\n"]}
{"Feb 10, 2025, 12:12 PMUpdated 47 days ago": ["As the president increases pressure to boost deportations of undocumented immigrants, Connecticut's Attorney General says he's working hard to protect them here in our state.", "William Tong was my guest this past week on Power and Politics.", "Agents at Immigration and Customs Enforcement are under increasing pressure as President Donald Trump has expressed anger that the amount of people deported in the first weeks of his administration is not higher.", "In order to fulfill Trump's Inauguration Day promise of \"millions and millions\" of deportations, the Trump administration would have to be deporting over 2,700 immigrants every day to reach 1 million in a year.", "Arrests do not always equal immediate detentions, much less deportations. The White House says of the more than 8,000 immigrants arrested in the first two weeks of the Trump administration, 461 were released. Tong says there should be safe places for immigrants in Connecticut.", "\"We're not going stand in the way right of the federal government doing its proper and lawful job but when you start going into sensitive places like schools and churches, in courthouses, and you make people feel unsafe, you know that has a ripple effect and it disturbs the proper functioning of a school or a courthouse, right frankly a house of worship,\" said Tong.", "Tong says it’s important for immigrants to know their rights and there are several agencies in Connecticut that can help."]}
{"Feb 14, 2025, 5:08 PMUpdated 42 days ago": ["Protesters gathered on the steps of the Theodore Roosevelt Executive and Legislative Building in Mineola, declaring that the Nassau police should not be working with ICE, after the county executive recently announced a collaboration between the two.", "One protester said that people are afraid to go to church.", "Legislator Carrie Solages said that attendance at schools has been dropping.", "Many protesters described a pervasive fear among immigrant communities.", "Nassau County Executive Bruce Blackman said that they are not going after people who are law abiding.", "“If you’re here with an immigration status that’s not legal, we’re not coming after you. We’re not raiding schools, we’re not raiding churches like they would have you believe,\" Blakeman said."]}
{"Feb 14, 2025, 2:22 AMUpdated 43 days ago": ["Mayor Eric Adams says he's 'working on' an executive order that would allow ICE to operate once again on Rikers Island. ", "The mayor's comment was part of a statement released by his office after he met with the Trump administration's \"border czar\" Tom Homan earlier today. ", "The full statement reads:", "This is a developing story."]}
{"Feb 12, 2025, 11:26 PMUpdated 44 days ago": [" President Donald Trump's newly installed attorney general, Pam Bondi, went after New York leaders Wednesday over the state's immigration policies, announcing a lawsuit in the latest effort by the Republican administration to carry out the president's hardline immigration campaign pledges.\n\n\tIn her first press conference since taking office last week, Bondi accused New York leaders of prioritizing “illegal aliens over American citizens.\" Standing in front of federal agents who have been tasked with helping in Trump's immigration crackdown, she echoed the president's rhetoric as she vowed the Justice Department would take on communities that thwart federal immigration efforts.\n\n\tThe lawsuit against New York Attorney General Letitia James and Gov. Kathy Hochul targets a state law that allows people who might not be in the U.S. legally to get driver’s licenses. The so-called Green Light Law was enacted partly to improve public safety on the roads, as people without licenses sometimes drove without one, or without having passed a road test. The state also makes it easier for holders of such licenses to get auto insurance, thus cutting down on crashes involving uninsured drivers.\n\n\tThe lawsuit describes the law as “a frontal assault on the federal immigration laws, and the federal authorities that administer them.\" It highlights a provision that requires the state's Department of Motor Vehicles commissioner to inform people who are in the country illegally when a federal immigration agency has requested their information. The Justice Department is asking the court to strike down the law.\n\n\t“This is a new DOJ, and we are taking steps to protect Americans,” said Bondi, with agents from the FBI, Bureau of Alcohol, Tobacco, Firearms and Explosives and Drug Enforcement Administration lined up behind her. “Millions of illegal aliens with violent records have flooded into our communities, bringing violence and deadly drugs with them.”\n\n\tBondi’s politically charged rhetoric, unusual for an institution that has historically been wary of aligning itself so directly with the White House, and the selection of legal targets raise fresh concerns that she could seek to use the agency’s law enforcement powers to go after the president’s adversaries. James, the New York attorney general, has drawn Trump’s ire by suing him, leading to a civil fraud judgment that stands to cost Trump nearly $500 million.\n\n\tJames said in a statement that she's prepared to defend the state's laws, which she said “protect the rights of all New Yorkers and keep our communities safe.”\n\n\tAvi Small, a spokesperson for Hochul, said the governor ”has been clear from day one: she supports deporting violent criminals who break our laws, believes that law-abiding families should not be targets, and will coordinate with federal authorities who have a judicial warrant.\"\n\n\tBondi appeared alongside Tammy Nobles, whose 20-year-old daughter Kayla was killed in Aberdeen, Maryland, in July 2022 by someone from El Salvador who entered the country illegally months earlier in Texas. The assailant, then 16, was released to a first cousin to pursue asylum, which is common practice under U.S. law and policy. He had been accused by authorities in El Salvador of affiliation with the violent MS-13 gang, according to a report by Republicans on the House Judiciary Committee.\n\n\tTo trumpet his immigration policies, Trump has often highlighted “angel moms” like Nobles, who lost their loved ones to violent crimes by people in the country illegally.\n\n\t“Tammy represents not only herself and her family but all of the great angel moms around this country who have suffered because of what the Biden administration did,” Bondi said. “And it’s over.”\n\n\tThe lawsuit comes days after the Justice Department sued the city of Chicago, alleging that its “ sanctuary” laws were thwarting federal efforts to enforce immigration laws.\n\n\tIn 2020, the Trump administration sought to pressure New York into changing its law by barring anyone from the state from enrolling in trusted traveler programs, meaning they would spend longer amounts of time going through security lines at airports.\n\n\tNew York’s governor at the time, Andrew Cuomo, offered to restore federal access to driving records on a limited basis, but said he wouldn’t let immigration agents see lists of people who had applied for the special licenses available to immigrants who couldn’t prove legal residency in the U.S.\n\n\tThe Trump administration ultimately restored New Yorkers’ access to the trusted traveler program after a brief legal fight.", "Hochul released a statement, saying, \"Earlier today, Attorney General Pam Bondi marched in front of the television cameras for a dramatic media briefing to announce she was filing charges against New York State related to our immigration laws. Hours later, when legal papers were shared with reporters, we learned this was smoke and mirrors: the Department of Justice was filing a routine civil action about a law passed in 2019 that has been upheld by the courts time and again.", "Here are the facts: our current laws allow federal immigration officials to access any DMV database with a judicial warrant. That's a common-sense approach that most New Yorkers support. But there's no way I'm letting federal agents, or Elon Musk's shadowy DOGE operation, get unfettered access to the personal data of any New Yorker in the DMV system like 16-year-old kids learning to drive and other vulnerable people.", "New York is proud that immigrants from across the globe come here searching for a better life — people like my grandparents who left Ireland looking for the American dream. We welcome law-abiding individuals who want to work, pay taxes and contribute to our communities, while at the same time protecting the public safety of all New Yorkers by cracking down on violent criminals.", "We expect Pam Bondi's worthless, publicity-driven lawsuit to be a total failure, just like all the others. Let me be clear: New York is not backing down.\""]}
{"Feb 12, 2025, 4:49 PMUpdated 45 days ago": ["Immigration and Customs Enforcement arrested a Brazilian man after he was released from a state prison.", "ICE agents say Emerson Eduardo Ferreira legally entered the country in 1999 but later violated his admission after being convicted of sexually assaulting a Connecticut resident in 2023.", "\"Emerson Eduardo Ferreira violated the terms of his lawful admission into the United States and brutally victimized a Connecticut resident,\" said acting ICE Enforcement and Removal Operations Field Office Director Patricia H. Hyde. \"He has shown a blatant disregard for the sanctity of our laws and the safety of our people.\" ", "ICE says it issued an immigration detainer against Ferreira last April with the Connecticut Department of Corrections and served him with a notice to appear before a Department of Justice immigration judge after arresting him.", "Ferreira remains in ICE custody."]}
{"Feb 5, 2025, 5:20 PMUpdated 52 days ago": ["East Hampton village's police chief told News 12 that his officers do not have the authority to ask for people's immigration status. ", "Some East Hampton residents said they're worried about people in their community being affected by the new federal immigration policy. ", "\"They've been a vital part of the community for a very long time,\" said Alex Lovett, of East Hampton. ", "The East Hampton police chief said village officers are not federal agents and won't be enforcing federal immigration laws.", "The police chief said his officers can't ignore a federal warrant, but he wants residents to know they should feel safe reporting crimes regardless of their immigration status. ", "\"If they're a victim of a crime, we don't want them to fear the police, we want them to call us so we can protect them,\" said East Hampton Police Chief Jeffrey Erickson.", " to calm residents' fears by giving out pamphlets explaining constitutional rights to those in attendance.", "People worried about the federal immigration policies say they are glad the village addressed some of their concerns about the local police. ", "\"I think it's a very good idea and very helpful considering we have a very large community here, and people rely on them,\" said Lovett. ", "The East Hampton police chief said none of the department's protocols have changed and that they will be policing the community the same way they have been for years. "]}
{"Feb 14, 2025, 3:22 AMUpdated 43 days ago": ["The mayor of Morristown is speaking out about an Immigration Customs Enforcement raid that happened in town where one person was arrested.", "Mayor Timothy Dougherty says neither the Morristown Police Department nor the local government was involved. He says the town is still seeking information about the incident.", "\"I want to be clear to Morristown residents that we value and respect our local immigrant community and that we will do everything in our power to ensure that their rights are respected and that they are treated with dignity and humanity during this uncertain time,” Dougherty told residents.", "The raid comes as a fourth federal judge blocks President Donald Trump’s executive order that would end birthright citizenship for children of immigrants who are in the United States illegally.", "New Jersey Attorney General Matt Platkin, ", " against the order – issued a statement Thursday applauding the decision.", "He says that more needs to be done, writing in part, “...This is not yet over, and we will continue to fight every single step of the way until President Trump is permanently prevented from trampling on the Fourteenth Amendment rights of all Americans.\"", "ICE raids have also been conducted in Newark and Paterson since Trump took office."]}
{"Feb 19, 2025, 1:37 PMUpdated 38 days ago": ["Westchester County Executive Ken Jenkins has addressed what he describes as misconceptions regarding immigration policies in the county.", "Jenkins clarified that Westchester is not a sanctuary county, emphasizing that it does not hinder the federal government's ability to enforce immigration laws.", "Jenkins explained that the county provides judicial warrants to U.S. Immigration and Customs Enforcement before releasing individuals from custody. He stated, \"When this document is filed, the county notifies ICE before releasing an individual from custody and may hold an individual for up to 48 hours beyond their release date to work through and let the fellow law enforcement folks do their job.\"", "This policy, according to Jenkins, has been in effect since 2018. However, he also noted that there is a policy preventing the county from assisting with federal investigations unless they pertain to criminal activities."]}
{"Feb 11, 2025, 12:10 PMUpdated 46 days ago": ["Dozens of people boarded buses early Tuesday morning, joining hundreds of immigrant New Yorkers from across the New York City, Long Island, and Westchester on a trip to Albany. ", "Their goal: to push for stronger protections and more community investments.", "One of the key issues on their agenda is the ", ", a proposed law that would prevent local police and state agencies from working with federal immigration officials. ", "Supporters argue that the bill would help build trust between immigrant families and law enforcement, allowing communities to feel safer.", "“This is very important because I know that our community and immigrant community has been under attack,” said Perla Silva, senior civic engagement coordinator", "with Make the Road New York. “We have been working closely with the community, and they are prepared. This is one of the ways that they’re showing up.”", "However, not everyone agrees with the proposed legislation. ", "Critics argue that local authorities should be able to cooperate with federal agencies, particularly when dealing with individuals accused of crimes. ", "Some lawmakers have expressed a need to balance protecting immigrant rights while ensuring public safety.", "Once in Albany, the group plans to hold a press conference and a vigil outside Gov. Kathy Hochul’s office before meeting with lawmakers to push for change. ", "Whether the ", " gains enough support in the legislature remains to be seen."]}
{"Feb 7, 2025, 4:43 PMUpdated 50 days ago": ["Connecticut Attorney General William Tong is in Boston Friday asking a federal court to overturn President Donald Trump's executive order ending birthright citizenship for the children of parents who are in the U.S. illegally.", "Tong joins more than a dozen other state attorneys general in the request.", "Two judges have already paused the order saying it violates the 14th Amendment.", "Tong says birthright citizenship is personal for immigrants like his father.", "\"He and my mom met in the Hartford area. They weren't looking for a place to have a baby -- have an anchor baby, as they call us.\" said Tong. \"They and my grandparents were running for their lives.\""]}
{"Feb 7, 2025, 11:48 AMUpdated 50 days ago": ["Amid growing concerns over the increased visibility of federal immigration enforcement in the village and surrounding areas, Pleasantville police are aiming to reassure the community.", "Agents have recently been spotted in Pleasantville, as well as in Sleepy Hollow, Peekskill, and Ramapo.", "During a recent meeting, Pleasantville Police Chief Erik Grutzner addressed the community's concerns, stating, \"If there are situations where we're asked to hold people, or investigate them for anything that's out of the purview of what we've done in the past, then we are respectfully declining those requests.\"", "Officials clarified that they have no current knowledge of ICE conducting raids in the village, but in past instances, the department was only informed on the morning of such activities. Residents are encouraged to contact local police if they suspect an ICE raid is occurring, allowing authorities to monitor the situation.", "Police say the community should still feel safe coming to them as victims and/or witnesses or if they need help, regardless of immigration status. "]}
{"Feb 7, 2025, 3:15 AMUpdated 50 days ago": ["The owner of a popular West New York restaurant says the impact of a fake video has had real consequences.", "Elio Barrera, the third-generation owner of ", ", says his tables have been empty ever since a fake social media video that described an Immigration and Customs Enforcement raid at one of his restaurant locations.", "“Not even just on a Thursday night - in general, this place would be packed,” Barrera said. “We haven't seen it like this ever.”", "Until late December, Barrera’s uncle ran a second location in Union City. Two weekends ago, a social media video with more than 1.5 million views - which has since been taken down - detailed a supposed ICE raid there. ", "The video shows the exterior of the former, empty restaurant, and describes the scenario using an AI-narrated voice. ", "But Barrera says it never happened, and couldn’t have, since that location is closed.", "“There have been no ICE raids here, or in any of our other locations,” he said. “I know the truth. But then looking at the comments, it was almost like, ‘Wow. People are believing this.’”", "Barrera says his family - originally immigrants from El Salvador - worked hard over 35 years to position their restaurant as a safe space and a slice of home.", "“It's almost like a stab in the back,” he said. “We've been here for so many years, we've catered to our Hispanic community, and to see what this video is doing to us, it's hurtful. I want people to feel like they're protected here.”", "The lost business has forced Barrera to cut 20-year employees.", "“They've been with me for so long,” Barrera said. “They're like my second family here, too, but at the end of the day, I'm just trying to see where I can save some money and try to see how we can work through this.”", "News 12 has reached out to ICE for further information but has not yet heard back.\n"]}
{"Feb 8, 2025, 3:47 AMUpdated 49 days ago": ["Dozens of community members gathered Friday in Mott Haven, demanding the city halt plans for a proposed migrant shelter on Bruckner Boulevard. ", "The facility is set to house over 2,200 single men, raising concerns among residents about safety and strained local resources.", "Protesters criticized city officials for what they say was a lack of community consultation before approving the shelter.", "The city confirmed the contract has been signed, with the shelter expected to open by the end of the month. ", "An exact date has not yet been provided.", " ", " "]}
{"Feb 3, 2025, 10:28 PMUpdated 53 days ago": ["The online movement asked immigrants not go to work, school, or shop just for the day. ", "Local businesses in Yonkers showed their support by closing their doors Monday in solidarity.", "\"We just organized and decided to shut down,\" said manager Samuel Leyva of La Pizzeria del Sabor.", "Cecilia Zuniga, co-owner of La Piñata Bakery, also closed her business for the day.", "\"As immigrants here in Yonkers, we are part of the backbone of the businesses, especially in this area. We are the backbone of this community,\" she said. \"We're here to make this country and this city better.\"", "Monday's movement was to protest recent immigration policies that have been enacted.", "News 12 contacted Mayor Mike Spano's office and members of City Council for comment, but did not hear back as of Monday evening."]}
{"Feb 5, 2025, 5:11 PMUpdated 52 days ago": ["Stony Brook Medicine says ICE agents need a court order to access its facility.", "The medical group says Immigration and Customs Enforcement agents are not allowed access to the hospital patient care or medical record areas unless they have a warrant or subpoena.", "The hospital says the warrants must be validated by the health system’s lawyers.", "In addition, the hospital says they cannot make arrests or do searches and interrogations in the hospital.", "Stony Brook University officials tell News 12 they are in the process of developing full guidance for campus facilities. They expect full guidance from the SUNY system in the coming weeks."]}
{"Feb 4, 2025, 4:55 PMUpdated 52 days ago": ["Nassau County Executive Bruce Blakeman announced a major change in immigration enforcement in the county this morning.\n\n\tBlakeman says 10 Nassau detectives will soon be able to assist U.S. Immigration and Customs Enforcement (ICE) by detaining those living in the county illegally and commit illegal offenses.\n\n\tDetectives will be able to hold those living here illegally when ICE agents are not readily available. ", "\n\n\tFifty Nassau Jail cells will be used, and Blakeman says the county will be reimbursed by the U.S. government for its efforts. ", "\n", "Some immigrant community leaders say this initiative will only increase fear in the immigrant community.", "“We do not want to see the police acting as immigration agents, people will not trust the police when they are in trouble,” said Cheryl Keshner, of the Long Island Language Advocates Coalition.", "Watch the full news conference from Executive Blakeman below:", "\n\t", "\n"]}
{"Feb 5, 2025, 12:45 PMUpdated 52 days ago": ["Long Island's immigrant community has questions regarding law enforcement's relationship with Immigration Customs Enforcement.", "This comes amid ", " that Nassau police will be assisting ICE with detaining immigrants they say are in the United States illegally and who have committed a crime.", "Make the Road NY says the move \"will only serve to increase the fear that members of our communities feel every day.\"", "Patrick Young, who teaches immigration law at Hofstra Law School, says these actions can create a level of mistrust in law enforcement among immigrant communities.", "Meanwhile, the NYCLU says in a statement, “Any partnership with ICE sends the message to immigrant communities that local law enforcement is not there to protect them, but is instead targeting them for deportation. Immigrants enrich Nassau County’s culture, economy, and communities — they deserve to feel safe and protected.\"\n"]}
{"Feb 5, 2025, 12:43 PMUpdated 52 days ago": ["Village of East Hampton officials and police held a special meeting Tuesday night about immigration enforcement.", "Dozens of people showed up to speak directly to police and local leaders about whether they would help U.S. Immigration and Customs Enforcement (ICE) agents who might come to the Village to enforce immigration laws.", "“A lot of people have a lot of fears,\" said Beatriz Rivas, of East Hampton Village. \"I hear a lot of people, they are worried.”", "\"There is a lot of speculation all around,\" said East Hampton Village business owner Alex Verdugo.", "\"It's clear to me that everybody thinks that ICE is just going to come and take anybody that is here...that is not what's happening,\" said East Hampton Village Mayor Jerry Larsen.", "\"We are not federal agents. We don't have the authority to ask for people's immigration status,\" said East Hampton Village Police Chief Jeffrey Erickson.", "While police will not be out asking questions about immigration status, Erickson says officers will not ignore a federal warrant.", "\"If it's a criminal, judicial warrant signed by a judge, it's a warrant we will enforce,” said Erickson.", "Verdugo asked at the meeting what he should do if ICE agents show up at his tree-trimming business.", "\"It's just a concern because I'm not on either side of it but I want to be in the middle and I want to do what's right for everybody,\" said Verdugo.", "Village leaders told residents and Verdugo, in English and Spanish, that they have rights guaranteed by the Constitution when it comes to any interaction with law enforcement and gave them pamphlets explaining them.\n\tVillage residents say they are glad to get their questions answered but remain concerned.", "\"The kids, they are very worried,\" said Rivas.", "Village leaders also repeatedly stressed at the meeting to residents and for anyone in the Village of East Hampton, to not be afraid to call the police to report a crime, if they need help, or if they need an ambulance, no matter their immigration status."]}
{"Feb 4, 2025, 10:05 PMUpdated 52 days ago": ["Village officials confirm that Immigration and Customs Enforcement agents were looking for an individual on Monday.", "It was not specified if the individual had a criminal record, or if anyone was detained.", "News 12 spoke with Village Mayor Rika Levin who said the village and local organizations have resources available to immigrants.", "\"Neighbors Link has a huge presence here, with a number of immigration lawyers who speak multiple languages,\" said Mayor Levin.", "Chief of Police Aaron Zimmerman added that regardless of status, the police are always a resource for people in need of emergency assistance.", "\"If you need police services, do not be scared to contact the police because of any perceived threat to your status here in the United States,\" said Chief Zimmerman.", "This is the fourth time this week alone that ICE agents have been spotted in Westchester County. Sleepy Hollow, Pleasantville, and Peekskill also confirmed ICE agents in their area this past week.", "Across Sleepy Hollow, Pleasantville, and now, Ossining – people have been dropping off instructions on what immigrants can do in English and in Spanish, if they are detained. Amy Hall, owner of Hudson Valley Books for Humanity, was one of the business owners to receive the leaflet.", "\"We were founded on immigration as a country,\" said Hall. \"How can we turn against the very people that make our community so beautiful and strong?\"", "Mayor Levin added that the community has been diverse for 150 years and that Ossining officials are proud of it."]}
{"Feb 3, 2025, 5:44 PMUpdated 53 days ago": ["Hundreds of Newburgh residents skipped work, skipped school and shut down their businesses Monday as they continue to send a message about the importance of immigrants to Newburgh's success. ", "The immigrant-friendly city is preparing for raids by agents with Immigration and Customs Enforcement.", "More than 200 business owners, students and community organizers attended a rally on Broadway Monday afternoon, while “closed” signs hung on businesses throughout the city.", "The protestors want to protect law-abiding people from a new campaign by ICE to deport millions of undocumented immigrants.", "The work stoppage and rally were part of a nationwide demonstration to show their neighbors and federal government officials what life would be like if they were not here.", "\"I cut school today,\" Newburgh student Juliet Perez-Solis said. \"To show that I support our community.\"", "Perez-Solis and her mother, Sharon Solis, do not trust ICE to prioritize removals of violent fugitives and gang members over non-violent people.", "During President Donald Trump's first term, ICE reportedly deported several Hudson Valley immigrants who had no histories of violence.", "Sharon Solis fears a repeat.", "\"Some people had to leave their home states because there weren't opportunities for their kids and for everybody, so they had to come here looking for a better life,\" she said. \"The American Dream is for you to be free and they're making us scared to even walk the streets.\"", "The Pew Research Center found there are 8.3 million undocumented immigrants in the American workforce.", "Newburgh City Councilwoman Giselle Martinez has taken a leading role in educating businesses and families about their rights when dealing with ICE.", "Martinez said the rally was another chance to educate.", "\"Informing our community about their rights was the best thing for us to do with all the misinformation and the panic happening in our communities,\" she said. ", "News 12 has not confirmed any arrests by ICE in Newburgh since President Trump took office last month.", "The community is organizing though, after repeated warnings from local officials that Newburgh — a city full of immigrant families — will be a target."]}
{",  and Feb 4, 2025, 3:06 PMUpdated 53 days ago": ["TRENTON, N.J. (AP) — New Jersey Gov. Phil Murphy sparked Republican outrage over recent comments suggesting he and the state's first lady offered an immigrant with uncertain immigration status the opportunity to stay at their home, but he didn't actually make the offer and the person never moved in, his spokesperson said Tuesday.", "The second term Democratic governor was relaying a conversation he had had with with first lady Tammy Murphy about someone they knew who was legally in the country but worried about their status, his spokesperson Mahen Gunaratna said. The governor had said he suggested inviting the person to stay at their house, but the offer wasn't made in the end, Gunaratna said.", "Murphy's initial comments came up over the weekend while he was speaking at progressive forum about how his administration could push back against Trump.", "“I don’t want to get into too much detail, but there’s someone in our broader universe whose immigration status is not yet at the point that they are trying to get it to,” Murphy said. “We said ‘You know what? Let’s have her live at our house above our garage, and good luck to the feds trying to come in and get her.’”", "Republicans pounced on the comment. Mario Kranjac, a Republican running to succeed Murphy, said it’s time for immigration officials to pay the governor a visit. Elon Musk, the world’s richest man, and recently confirmed to be a “ ", ",” has been heading up what he and the White House call the Department of Government Efficiency. In a post on X showing Murphy’s statement, Musk said: “Wow.”", "Murphy’s administration has been largely supportive of immigration. Under his tenure, the state ", " limiting cooperation between local New Jersey police and immigration officials. A bill that would make the directive state law is pending in the Legislature, but hasn’t advanced.", "It has gotten renewed attention since Trump’s second administration began and immigration officials arrested people in Newark last month. The arrests led immigrant rights advocates to call out “Where’s Governor Murphy?” during a ", " to deride the immigration enforcement.", "Murphy, a wealthy former Goldman Sachs executive who served as an ambassador to Germany during the Obama administration, has a home along the Navesink River in Middletown, New Jersey."]}
{"Jan 31, 2025, 11:58 PMUpdated 56 days ago": ["Newburgh officials are escalating a campaign to educate the city's large immigrant population about the threat of Immigration and Customs Enforcement stings in the community, while also shooting down numerous recent false rumors that ICE arrests are already happening.", "Business owners told News 12 Friday online that misinformation is hurting their shops as much as verified reports of ICE operations would.", "Azuzena Garcia, owner of Hermanas Garcia on Washington Street, has been trying to educate her customers about their 4th and 5th Amendment rights: They do not have speak to ICE agents and they do not have to consent to a search of their persons or their homes if the agents do not have a judicial warrant.", "\"I have all these little cards,\" Garcia said in Spanish, showing News 12 a red business card with a list of constitutional rights. \"I haven't given them out much today ... Unfortunately, look, this morning there are no customers and it's not just here. Other shops are affected too.\"", "She said the sudden dip in traffic at businesses that primarily serve Spanish speakers was likely due to an online post warning that ICE agents were operating near City Hall and south of Broadway.", "\"The rumors on Facebook and [other] social networks about ICE — I don't know if they're true because they're only rumors,\" Garcia said. \"It is scaring customers from coming here.\"", "City and county officials told News 12 Friday that none of the recent posts warning of ICE operations were true.", "A photo shared early Friday that warned of ICE agents actually showed members of the U.S. Marshals Service.", "Posts earlier this month incorrectly claimed ICE agents were operating throughout the city, including at local schools.", "City officials told News 12 around the time of those incorrect posts that New York State Police investigators were executing several warrants in the city.", "Several immigrant rights advocates and elected officials told News 12 they have been receiving panicked phone calls from business owners concerned not just about an absence of customers but also an absence of employees who might be wary of commuting to work.", "Orange County Legislator Genesis Ramos, who represents the Newburgh area, has been trying to ease those fears and encourage people — documented or not — to exercise their rights.", "\"We've seen reports across the country of ICE using deceptive tactics to ultimately arrest people ,\" she said. \"It is so critical that we inform people in the community of their rights.\"", "City Council Member Ramona Monteverde said a group of city leaders would be visiting with business owners this weekend to dispel the false rumors and to prepare them for future ICE activity, which they expect to happen eventually.", "Before the change in presidents, an ICE spokesperson told News 12 the agency prioritizes removals of undocumented immigrants with histories of violence over those without histories of violence.", "Officials with the current administration said they are targeting \"criminals\" and have repeatedly said in other interviews they are looking for \"the worst, first.\""]}
{"Jan 31, 2025, 10:31 PMUpdated 56 days ago": ["Immigration and Customs Enforcement (ICE) agents were looking for an individual with a criminal record in Peekskill on Friday.", "Mayor Vivian McKenzie told News 12 that ICE did not find the person they were looking for, but found another person who has a criminal record.", "News 12 is working to find out where ICE was looking for this individual. McKenzie says they checked a couple of places. ", "McKenzie says ICE left Peekskill around 8:30 a.m. She says she doesn't know if ICE will be back.", "\"We can't do anything that intercedes with their operation, but we are really trying to make sure our residents are aware with the facts,\" says McKenzie.", "The Peekskill Police Department had no role in this operation.", "ICE has also been in Sleepy Hollow, Pleasantville and Spring Valley this week."]}
{"Jan 31, 2025, 10:56 AMUpdated 57 days ago": ["NYC Health + Hospitals is ensuring that Bronx residents are safe to come to its hospitals regardless of their immigration status.", "NYC Health + Hospitals has made it clear they will not ask about immigration status from anyone visiting its hospitals for treatment. It took to X Thursday night saying \"We want you to get the care you need today, before you get sick and before it becomes an emergency. All New Yorkers should seek care without fear.\"", "This comes more than a week after President Donald Trump's executive order for mass deportations. The administration also changed the longstanding policy to avoid ICE arrests at so-called safe places like schools, churches and community centers.", "New York City still remains a sanctuary city, and under the guidance migrants are still protected under the sanctuary laws. "]}
{"Jan 31, 2025, 3:34 AMUpdated 57 days ago": ["Southold residents attending the town's information session on federal immigration enforcement say they're worried about some of their neighbors in their community.", "\"Targeted by people that don't agree with them being here maybe. As a Latina that's what I'm very concerned about,\" said Bianca Munguia-Howie, of Southold. ", "Town officials answered written questions from concerned residents, mostly having to do with how the Southold police force will handle immigration laws.", "\"Local law-enforcement officers do not have the authority to enforce federal immigration violations,\" said Southold Police Chief Steve Grattan.", "Southold Supervisor Al Krupski Jr. says he wants people to know what the town's role is in the president's immigration enforcement.", "\"That was really the message here tonight, so people don't think well why aren't the town police doing that or this because a lot of times they're just not legally authorized to do so,\" he said. ", "Town officials say local police will not ask anyone about their immigration status. They say federal agents need a warrant to enter a home or workplace. The superintendent of Mattituck Cutchogue Union Free School District says if any ICE agents were to visit their schools, they would need a search warrant.", "The Southold town supervisor says anyone with questions or concerns can reach out to his office."]}
{"Jan 31, 2025, 12:11 PMUpdated 57 days ago": ["NYC Health + Hospitals took to social media late Thursday night to assure patients that the hospital system will not be asking patients about their immigration status as part of their hospital visit.", "The announcement comes amid fears spread online following the Trump administrations rescinding federal guidelines that restricted ICE activities at so called sensitive locations including schools, hospitals and churches.", "The Trump administration has also scaled up the number ICE raids and immigration enforcement actions compared to the previous administration.", "As part of the statement, the hospital system said that \"All New Yorkers should seek care without fear.\" ", "It's a statement echoed by Mayor Eric Adams this week who urged children to continue going to school and for sick New Yorkers to continue to seek care. ", "Despite the new federal guidance, NYC remains a sanctuary city with additional protections for undocumented New Yorkers. "]}
{"Jan 30, 2025, 5:33 PMUpdated 57 days ago": ["Local clergy members have stepped up to support affected families in response to recent immigration enforcement actions by the federal government.", "At the Better Life Ministry in Jersey City, pastors and ministers from various denominations gathered to address the concerns of those worried about Immigration and Customs Enforcement and deportation today.", "The initiative includes the launch of a 24/7 hotline designed to provide legal counsel, social services and pastoral care to families where the primary breadwinner might face deportation, despite some family members being U.S. citizens.", "The effort comes after the clergy received thousands of calls from concerned community members across New Jersey.", "\"The family comes to us, a lot of children. The father will be in custody, and he doesn’t have any more food to provide to the house, no more money to pay the rent or the room that they rent. That’s when our New Jersey Latino Pastors and Ministers come and provide these resources,\" says the Rev. Bolivar Flores, of Latino Pastors and Ministers.", "Flores also noted that while many in the Latino community supported President Donald Trump, there is now a pressing need to highlight the impact of these immigration policies on families.", "The hotline number for those seeking assistance is 551-255-5500."]}
{"Jan 30, 2025, 5:31 PMUpdated 57 days ago": ["Immigration and Customs Enforcement agents were reportedly spotted Thursday morning on Wheeler Street in downtown Pleasantville, a street known for its vibrant food and service businesses.", "Village officials say the Pleasantville Police Department was notified that ICE agents would be in the area to locate a specific individual with a criminal warrant.", "Business owners, who preferred anonymity, reported seeing approximately eight ICE agents. The community had mixed reactions, with some residents expressing discomfort over the presence of federal immigration enforcement in their peaceful town.", "\"We just call it home, and we just feel very safe. So, the fact that they're here is disconcerting because it's like, what is going on? It feels maybe too invasive,\"saidJames Bourke, of Yorktown.\n\tOne local business owner was given a flyer in both English and Spanish advising on how to respond if detained by ICE.", "Next Thursday, Feb. 6 at 7:30 p.m., Pleasantville Police Chief Erik Grutzner, and Village Trustee W. Paul Alvarez, will host a meeting both in person and virtually on polices and procedures related to immigration status.\n\tChief Grutzner hopes the meeting will ensure residents feel comfortable, regardless of their status, contacting police. ", "\"For local law enforcement, that is not an issue. That is not something we take into account in these types of situations, so we want people to know they can still feel comfortable to come to us,\" said Chief Grutzner.", "News 12 contacted ICE, who said it cannot confirm or discuss ongoing operations for security and safety reasons.", "It is unclear at this time whether or not the individual was taken into custody.", "In response to the situation, Pleasantville Superintendent Dr. Tina Desa released a statement saying the district will be adhering to Gov. Kathy Hochul's guidance on safeguarding rights of immigrant students.", "The mayor of Pleasantville was additionally contacted, but has not returned News 12's calls."]}
{"Jan 30, 2025, 3:42 AMUpdated 58 days ago": ["The Trump administration defended a decision to roll back protections for hundreds of thousands of Venezuelans living in the United States.", "Some people could face deportation in just a few months.", "It's left many other immigrants with protected status worried about their future. Haitian immigrant Louismarie is one of them.", "He lives in the Hudson Valley and said he was one of the Haitians who got an \"offer\" to come the United States, known as humanitarian parole. It's a Biden-era program that grants temporary immigration status to people from countries like Haiti and Cuba.", "Louismarie told News 12 that he is scared about his status as he seeks asylum.", "\"It is very frustrating,\" Louismarie said. \"People are afraid to leave their house.\"", "While it's unclear what will happen, some immigrant service groups in the area are calling on the administration to protect these people. "]}
{"Jan 29, 2025, 4:05 AMUpdated 59 days ago": ["The first known stop of the day for Federal Immigration and Customs Enforcement agents in the area was 1372 Ogden Ave. in Highbridge.\n\n\tICE said it had its sights set on an illegal immigrant, with multiple criminal charges living in the building.\n\n\tThe targeted operation began before the sun came up, as armed ICE and DEA agents made an arrest of an alleged criminal illegal immigrant.\n\n\tAccording to the Department of Homeland Security, the target has a record of crimes from Aurora, Colorado to New York that includes kidnapping, burglary and assault.\n\n\tDHS Secretary Kristi Noem was along for the ride, sharing video of the raid to her social media account.\n\n\tThe enforcement efforts began one day after President Donald Trump was sworn in. DHS has since carried out the president's orders to crack down on illegal immigration, starting with the deportation of violent criminals.\n\n\tNeighbors who live in the Ogden Avenue building spoke to News 12 about the raid.\n\n\t\"I was planning on calling ICE to be honest with you, so they got here before I was able to call them. There's 15 of them in a one-bedroom apartment,\" said one neighbor who did not want to be identified by name.\n\n\tOther people who live nearby say they fear what could come next.\n\n\t\"There is a lot of bad people the immigrate. There's a lot good people who immigrate I feel bad for the ones who are actually really good people and just want to make a living for themselves, this country is founded on immigrants,\" said Kobi Reid. "]}
{"Jan 29, 2025, 3:26 AMUpdated 59 days ago": ["Riverhead residents say they have mixed thoughts about a letter sent to residents about possible immigration enforcement in the town by federal agents.", "The letter says in part that \"the Town of Riverhead stands firmly behind the new immigration policies set forth by the Trump Administration.\"", "You can read the full letter here:", "\n\n\tAs News 12 has reported, Trump says he is cracking down on illegal immigration, and immigration agents can go into schools and churches.\n\n\tIt's ridiculous, it's a scare tactic.\" said one man News 12 spoke to in Riverhead on Tuesday about the immigration policy.", "The letter from Riverhead, the second one it has sent on immigration enforcement policy in the last few days, comes on the heels of a letter from the Riverhead School District.\n\n\tThat letter lays out how the district says it will follow New York state law, which doesn't allow immigration enforcement on school grounds without proper legal documentation.\n\n\tIt's a policy that residents who News 12 spoke to say they support.\n\n\t\"That seems a little too much to be going after kids so young, just trying to go to school, just trying to you know, be a kid,\" said a man. "]}
{" and Jan 29, 2025, 3:12 AMUpdated 59 days ago": ["early Tuesday morning. ", "One of those raids took place at 2065 Creston Ave. Neighbors tell News 12 that a neighbor was taken into custody. ", "News 12’s Elly Morillo shares the reaction from those who heard it all go down.", "There were also unconfirmed reports of another ICE raid in the area. News 12's Tim Harfmann was on the scene with the latest details. "]}
{" and Jan 29, 2025, 12:16 PMUpdated 59 days ago": ["Residents in Sleepy Hollow shared their concerns at a board meeting on Tuesday that took place just hours after ICE agents were spotted on the ground in the village.", "One man who spoke during the public comment section at the meeting told trustees that anxiety is high.", "\"Right now, there's a lot of fear in the community,\" he said.", "The comment came just hours after News 12 was sent a video that shows officers at 194 Beekman Ave. in Sleepy Hollow around 10 a.m. on Tuesday. ", "Mayor Martin Rutyna said he was surprised by the activity. ", "According to a Facebook post, Sleepy Hollow's police department was notified that ICE was going to try to serve an immigration warrant on two specific people with a criminal past.", "\"The agent did not state or imply that there would be any mass round up, instead they were in Sleepy Hollow for two suspects with criminal pasts,\" Rutyna said. \"As of now, we have not been notified whether either of the suspects have been served, nor is the village of Sleepy Hollow police department involved in serving these warrants.\"", "News 12 reached out to ICE for comment but have not heard back yet. ", "However, the mayor told News 12 that he is focused on making sure that everyone in his village feels safe.", "Karin Anderson Ponzer, the director of Neighbors Link, a Westchester-based nonprofit that works with neighbors in immigrant communities, also stressed the importance of safety.", "\"What we all care about the most is keeping our community strong and safe and we do that through educating and empowering one another and not through fear,\" Anderson Ponzer said.", "The director encouraged everyone to know their rights regardless of their immigration status.", "For more information about the resources that the group provides, please visit this website. "]}
{"Jan 28, 2025, 11:05 PMUpdated 59 days ago": ["The East End of Long Island counts many immigrants as its residents. ", "Advocates tell News 12 there is fear among those who are both undocumented and documented. ", "Minerva Perez, executive director of OLA of Eastern Long Island, said that businesses are going to be “drastically affected” by the fear that their own employees have about showing up to work.", "The Town of Southold is holding a community meeting on Thursday night on its “policing policy” amid ICE activities. ", "The town released a statement saying in part that: “The Town will not assist ICE or any other federal agency in the enforcement of federal laws. The Town’s Police Department will focus on maintaining public safety and will continue to treat all residents with respect, regardless of race, national origin, citizenship or any other matter which may define us.”"]}
{"Jan 28, 2025, 5:34 PMUpdated 59 days ago": ["Sleepy Hollow police confirm ICE presence in Sleepy Hollow was for 2 specific people with criminal past", "In a statement, officials with the Sleepy Hollow Police Department confirmed they were notified that U.S. Immigration and Customs Enforcement would be attempting to serve immigration warrants to two specific individuals with criminal pasts.", "A video sent anonymously to News 12 showed around six officers, some with \"ICE\" written on their jackets, were standing on the property of 194 Beekman Ave.", "News 12 has reached out to ICE for a comment but has not heard back.", "Stay with News 12 for more on this developing story. "]}
{"Jan 28, 2025, 10:34 PMUpdated 59 days ago": ["As the fear of immigration raids across New Jersey rises, organizations that cater to those who are new to the United States are informing people of their rights.", "Within the city of Newark, immigrants are at the heart of the Ironbound section. Within those neighborhoods, workshops are being held, instructing people on what to do if Immigration and Customs Enforcement shows up at their front door.", "GlendyTsitouras is with the American Friends Service Committee.", "“The first thing we say is do not open the door. ICE cannot enter into your home unless they have a warrant signed by a judge,\" she says.", "Tsitouras has been teaching people their legal rights and handing out cards that explicitly say:", "\n\t", "\n", "“Know Your Rights” cards even offer a script for what to say if approached.", "It reads, \"Officer, I do not wish to speak with you, answer your questions, or sign or hand you any documents based on my 5th Amendment rights under the United States Constitution.” ", "Tsitouras says these questions have ramped up since three people were arrested at Ocean Seafood Depot in Newark in an ICE raid.", "She adds that the raids around the country have had another impact. ", "“So many people are not sending kids to school anymore because they’re afraid,\" she says.", "She is telling these parents that they should be sending their kids to school and adds to stop listening to rhetoric on social media and get educated."]}
{"Jan 28, 2025, 9:55 PMUpdated 59 days ago": ["Deportations and ICE raids continue to make headlines across the nation.", "The issue impacts many children and their families. ", "Melissa Whitson, a psychologist and psychology professor at University of New Haven, says this can be alarming for children.", "\"Adjusting your language and also adjusting how much information you provide you don't want to give all the information to younger kids, answering their questions honestly but limited, and at a level that is appropriate that won't scare them,\" advises Whitson.", "She says the most important thing is to not inflict unnecessary fear onto a child but be honest. Younger children don't need to be given all the information, while teenagers have a wider grasp on topics like immigration. Couple those conversations with reassurance.", "\"Letting children know we have lots of friends and supports and things like that at all age levels,\" says Whitson, \"something like, 'to be allowed in this country we have paperwork, we have different things, documents and things like that, and we have some but not all,' to make them understand a little bit about that process.\"", "Now that possible raids could happen on school grounds, Whitson mentions the possible impacts it'll have on attendance but she also says it's important to respect what parents feel is the best course of action for their families.", "The Connecticut State Department of Education issued a guidance document to every K-12 public school district in the state in response to questions regarding the impact that recent changes in policy guidance from the U.S. Department of Homeland Security pertaining to immigration enforcement activities may have on school operations, student privacy, and the safeguarding of students while in school.", "You can find that guidance ", ". "]}
{"Jan 28, 2025, 11:34 AMUpdated 59 days ago": ["A local immigration attorney says his clients are living in fear about possible deportations.", "\"They're hiding under their beds, trembling at night. They're having nightmares,\" says Stamford immigration attorney Phil Berns.", "Berns says his clients are afraid Immigration and Customs Enforcement agents will take them away. This comes amid reports of an increased presence of ICE agents in Connecticut over the weekend.", "\"I think it's going to be worse than people expect. I think we're going to see some really, as we did 20 years ago, some really bad violations of people's rights. Treating people with extreme indignity,\" says Berns. ", "A senior Trump administration official says immigration authorities made close to 1,200 arrests in just one day across the country, and nearly half of those detained don't have criminal records. ", "Berns says you should know your rights. If ICE approaches you or your home, you have the right to remain silent and refuse to sign anything without speaking to a lawyer. ICE cannot enter your home without a valid warrant signed by a judge.", "\"If the immigration service doesn't know what country you're from, it's impossible to deport you,\" says Berns.", "Statistically, Berns says 200,000 immigrants have been deported from the U.S. per year. He says it would take 55 years or more to deport the last of the 11-14 million immigrants who are here.", "\"There's a very good chance it's going to lose steam after six months, a year or two years,\" says Berns.", "Berns says being undocumented is not considered a crime, but instead a civil offense. However, it's considered a crime when an undocumented immigrant who was previously deported re-enters the U.S. without permission.", "Berns says Obama deported more immigrants than any other U.S. president to this point ."]}
{"Jan 28, 2025, 2:45 AMUpdated 60 days ago": ["Susan Schnitzer, CEO of the Bridgeport-based Connecticut Institute for Refugees & Immigrants, says the nonprofit - whose mission is to help refugees and immigrants resettle in the United States - has lost $300,000 in funding since the Trump administration took over.", "\"Resettlement agencies such as ours are no longer allowed to use federal funds for this resettlement program to work with folks who are here,\" Schnitzer said Monday.", "\"It's devastating to think that this is the message that we as a nation are sending out to the world,\" she said.", "The cuts come as President Donald Trump cracks down on undocumented residents nationwide.", "\"But we are not allowing these cuts to interfere with our services. We will continue to help all of the refugees and immigrants we serve through other funding sources,\" Schnitzer said. "]}
{" and Jan 27, 2025, 1:21 PMUpdated 61 days ago": ["Days after an U.S. Immigration and Customs Enforcement raid in Newark, city officials in Paterson are speaking out about ICE and immigration.", "The mayor of Paterson says ICE was in the city on Sunday. In an exclusive interview this morning , Mayor André Sayegh reported that he received information that ICE was present at a barbershop on Wayne Avenue on Sunday.", "He is currently seeking more details regarding the incident, including whether any arrests were made.", "\"I can tell you there are people in Paterson that are panicking. A priest called me and said some parishioners were crying tears of fear. I want to reassure them they should not panic. There is a procedure they must abide by, and we're asking the same of federal officials. We don't want them to infringe on people's constitutional rights.\"", "Sayegh acknowledges the significant immigrant population in Paterson and emphasizes the importance of residents knowing their rights and understanding the city's response plan.", "In Paterson, city officials are providing what they call \"critical ICE guidance\" – focusing on informing the community about what to do if approached by ICE, understanding their rights and highlighting resources available for individuals and families.", "This is just the latest ", "at the ", ". The raid resulted in three arrests.", "ICE raids also took place across the country this weekend. It reported nearly 1,000 arrests and more than 500 detainers on Sunday, with operations in at least Chicago, Atlanta, Puerto Rico, Colorado, Los Angeles, and Austin."]}
{"Jan 28, 2025, 5:17 PMUpdated 60 days ago": ["Freeport administrators sent a letter home to parents saying student protection is first priority amid recent federal immigration actions. Other schools on Long Island are issuing similar statements.", "In the letter, Freeport says the recently issued presidential executive orders will not interfere with students' education. The district says it will \"take every step possible to protect the rights of all our children to a free and public education.\"", "\"I think it's important to protect the kids right, that's paramount in America, that's the future,\" said Matt Madacs, of Merrick. ", "The Patchogue-Medford Union Free School District told News 12 that \"the district does not authorize law enforcement agencies to access school grounds for the purpose of detaining, arresting, or questioning unless such access is related to an alleged crime occurring on school grounds, or pursuant to a warrant or court order.\"", "The Riverhead Central School District sent a letter to the community last week saying immigration enforcement will be prohibited on school grounds without proper documentation.", "\"Education is most important and to disrupt that disrupts the entire family,\" said Walter Silver Thompson, of Freeport. ", "Freeport Public Schools declined to speak with News 12. ", "News 12 reached out to the Freeport mayor and the Nassau County executive on this and is waiting to hear back. "]}
{" and Jan 25, 2025, 12:46 PMUpdated 63 days ago": ["As President Donald Trump and his administration have started their deportation plans and cracking down on immigration, a Bridgeport attorney says people need to be aware of their rights.", "Mark Arons says this is critical, especially if people are stopped by U.S. Immigration and Customs Enforcement agents on private property.", "Aarons says any raid conducted by federal agents require a warrant signed by a judge.", "\"Otherwise, it's a clear violation of the United States Constitution,\" he said.", "However, Arons warns that even if a person demands to see a warrant, agents may ignore the request.", "Along with knowing their rights, attorneys also recommend those who are undocumented ", "."]}
{"Jan 28, 2025, 5:43 PMUpdated 60 days ago": ["The Department of Homeland Security and the U.S. Immigration and Customs Enforcement are in The Bronx this morning making arrests, according to Homeland Security Secretary Kristi Noem.", "The secretary posted on X this morning about the enforcement", "\n\t", "\n", "In a video, a man can be seen being taken into custody. Noem says he has kidnapping, assault and burglary charges against him.", "The move is all part of President Donald Trump’s plan for the crackdown on immigration", "\n\t", "\n", "Noem is in New York City this morning.", "\n\t", "\n", "The New York Immigration Coalition said on X, formerly Twitter, that it wants to make sure New Yorkers know their rights. ", "\n\t", "\n", "The organization posted these tips for individuals approached by U.S. Immigration and Customs Enforcement.", "\n\t", "\n", "The NYPD issued a statement saying, \"Pursuant to New York City and New York State law, the NYPD does not engage in civil immigration enforcement, assist in any manner with civil immigration enforcement, or allow any Department resources to be used in connection with civil immigration enforcement. Also in accordance with city and state law, the Department continues to work daily with federal law enforcement agencies in connection with a wide range of criminal investigations. In particular, the Department participates in task forces with a variety of federal law enforcement agencies investigating violations of federal criminal law.\""]}
{" and Jan 24, 2025, 5:10 PMUpdated 63 days ago": ["In a move to protect its students, the Riverhead School District has made it clear that it will not allow immigration enforcement operations within its schools, despite a controversial directive from the White House. ", "This decision comes at a time when U.S. Immigration and Customs Enforcement (ICE) activities are increasing nationwide, leading to widespread concerns about potential deportations.", "The Riverhead School District, which serves a population that is 64% Hispanic or Latino, says it is committed to safeguarding all of its students, regardless of their immigration status. ", "In ", " to the community, the district reinforced its position, stating: \"The Riverhead School District will always stand in defiance of any initiative, regardless of its source, that threatens the safety and well-being of any of our students.\"", "\"I don't think it's right. I really don't,\" said one Riverhead resident, expressing concern over potential ICE raids in schools. The fear of mass deportations has created significant anxiety within immigrant communities in the area.", "Suffolk County Executive Ed Romaine, while stopping short of commenting directly on whether immigration agents should be allowed in schools, emphasized that enforcement efforts should be focused on individuals who have committed crimes. ", "\"At a county level, we are going to look to remove those people who are here illegally that commit crimes,\" Romaine stated, distancing himself from the more controversial aspects of immigration policy.", "Meanwhile, Rep. Nick LaLota, who has voiced support for immigration enforcement, urged a more cautious approach when it comes to schools. ", "He wrote in a statement, \"Whenever possible, officials should avoid conducting raids at schools to prevent unnecessary trauma for innocent children.\"", "The Riverhead School District says its stance is backed by New York state law, which guarantees every child the right to a public education, regardless of immigration status. ", "\"They have the law behind them to at this moment make sure their students, whether they're documented or not, have a right to an education and are safe,\" said Minerva Perez, executive director of OLA of Eastern Long Island, an advocacy group for the Latino community.", "Riverhead officials pointed to guidance from the state, which mandates that ", "cannot occur on school grounds without proper documentation. ", "Additionally, Riverhead Town Supervisor Tim Hubbard confirmed that the Riverhead Police Department will not stop, question or arrest individuals solely based on their suspected immigration status.", "Read the full letter below:"]}
{"Nov 8, 2024, 3:32 AMUpdated 141 days ago": ["Immigrants and their allies rallied in Foley Square on Thursday night in support of immigration justice and to protect families from mass deportations.", "The New York Immigration Coalition and partner organizations spoke about immigration rights and how undocumented immigrants can protect themselves.", "\"We are at the beginning of an urgent fight to protect our freedoms and our communitie,\" said Lovelie Tejada, with the New York Immigration Coalition.", "President-elect Donald Trump promised to crack down on illegal immigration when he returns to the White House in January.", "\"We are going to seal up those borders, we want people to come back in, but they have to come in legally, they have to come in legally,\" Trump said during his victory speech early Wednesday morning.", "Joo Han is the director of the Asian American Federation.", "\"We are already hearing that families are saying 'What do we need to do?' Our families are saying 'Do we need to go underground?' A lot of the same fears are being stoked,\" said Han.", "New York City is a sanctuary city, meaning there are policies in place that protect undocumented immigrants living there from federal immigration agents, with the exception of a crime being committed.", "Mayor Eric Adams said he spoke with Trump after his victory but did not disclose whether immigration was a topic of discussion.", "\"Trump has made deportation his very agenda, he has been attacking immigrant New Yorkers, and we want to make sure that we remind him that, no we have done this before and we will continue to do it,\" said Winnie Ch\"We are going to seal up those boards, ew York Immigration Coalition."]}
{"Jan 24, 2025, 10:25 PMUpdated 63 days ago": ["Proyecto Faro, an immigration advocacy organization with offices in Spring Valley and Stony Point, are informing undocumented people of their rights when dealing with Immigration and Customs Enforcement (ICE).", "The group is doing so especially in light of recent ICE enforcement across the country and reports of activity in Rockland. They posted online earlier this week that ICE was in different parts of Rockland. While not disclosing their sources specifically, they tell News 12 the information came from different people in the community.", "News 12’s Diane Caruso reports a few of her law enforcement sources in the county had not heard of nor could they verify ICE activity. While one told her ICE activity involved those with criminal backgrounds. ", "News 12 has reached out to various federal agencies to find out if ICE has been in Rockland and we have not heard back. ", "\"We really need to be able to make sure that the community is well informed,” said Dilcia Suazo, the co-executive director of Proyecto Faro. \"We want everyone, also the community members, to be prepared and to be able to make sure that everyone has a safety plan.\" ", "Suazo says ICE doesn't need to contact local law enforcement.", "Proyecto Faro is working to inform the immigrant community of their rights.", "\"If the order is not signed by a judge, they could actually let the ICE officer know, 'No, it's not an enforceable order. I cannot say anything else,'\" Suazo explains.", "The Trump administration says criminals are the target of ice enforcement across the country.", "Rockland County Executive Ed Day provided News 12 with the following statement following our request for information for this story: ", "“Recent speculation regarding U.S. Immigration and Customs Enforcement (ICE) activity in Rockland County has led to concern within our community. We want to take this opportunity to clarify the facts as we know them and reassure our residents.", "The County of Rockland has no role in the enforcement actions of federal immigration authorities, nor do we have any knowledge of whether this is happening or are we provided any type of notice of actions of law enforcement.", "However, it is important to highlight that reports about ICE’s Enforcement and Removal Operations (ERO) indicate those being targeted are individuals with charges or convictions including sexual assault, robbery, aggravated assault and drug offenses, a measured response consistent with circumstances and existing protocol.", "Again, these operations are conducted solely by federal agencies, and the County does not participate in detaining or deporting individuals.", "Questions or concerns regarding immigration enforcement should be directed to the appropriate federal agencies directly.”"]}
{"Jan 24, 2025, 1:11 AMUpdated 64 days ago": ["Newark Mayor Ras Baraka says that U.S. Immigration and Customs Enforcement agents raided an unnamed \"local establishment\" in the city on Thursday.", "Residents tell News 12 that happened at a business on Adams Street.", "This apparent raid comes just days after President Donald Trump signed a number of executive orders as part of an immigration crackdown.", "Baraka blasted the Trump administration following the raid.", "\"Today, U.S. Immigration and Customs Enforcement agents raided a local establishment in the city of Newark, detaining undocumented residents as well as citizens, without producing a warrant. One of the detainees is a U.S. military veteran, who suffered the indignity of having the legitimacy of his military documentation questioned,” Baraks wrote.", "The mayor continued, “This egregious act is in plain violation of the Fourth Amendment of the U.S. Constitution, which guarantees 'the right of the people be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures. Newark will not stand by idly while people are being unlawfully terrorized.\"", "The mayor said he plans to hold a press conference but did not specify when.", "A spokesperson for ICE issued a statement about the raid to News 12.", "\"U.S. Immigration and Customs Enforcement may encounter U.S. citizens while conducting fieldwork and may request identification to establish an individual’s identity as was the case during a targeted enforcement operation at a worksite today in Newark, New Jersey. This is an active investigation and, per ICE policy, we cannot discuss ongoing investigations,\" the spokesperson wrote.", "Similar raids have happened in a number of other states on Thursday, including New York."]}
