{"title": ["Concern for a Flemington man who may have been detained by ICE", "ICE Arrests Owner Of YaYa Noodles In Somerset County", "'People Are Panicking': Mayor Addresses Reports Of ICE Agents In Paterson", "ICE Raid locations - sticky thread", "ICE Raids", "Sightings in NJ", "ICE conducts raids in Princeton"], "selftext": ["Just seeing a page on Facebook and an Instagram post today about a fellow called Karim Daoud who lives in Flemington who they say was apprehended by ICE. \n\nI just wondered if folks in the community are aware of this and have heard anything. I hope Karim and his family are OK. \n", " ", " ", "Mods - can we please get a sticky going of where ICE raids have taken place to document these actions? We need a way to document where these have taken place. ", "I know a post about the one in Newark got a lot of attention, but I heard there were also raids in Vineland and East Brunswick. Exactly how true this is, I cannot say as of right now, so take it lightly, but stay alert nonetheless.\n\nMORE SIGHTINGS IN LAKEWOOD, NEPTUNE/ASBURY, LONG BRANCH, BELMAR AND NEW BRUNSWICK TRAIN STATION ( 1/24/25 )\n\nHOUSE TO HOUSE RAIDS IN PLEASANTVILLE, RIGHT OUTSIDE OF AC. ( 1/24/25 )\n\nSIGHTING AT RUTGERS NEW BRUNSWICK. ( 1/24/25 )\n\nPlease, please be careful, everyone. \n\nIf you have the ability to safely do so: Distract ICE agents. Don't do anything illegal or that will get you hurt, but waste their time if you can. \n\nRemember: Immigrant or not: YOU DO NOT NEED TO SPEAK WITH THEM. Don't speak without a lawyer present. Don't answer questions. Demand and verify real warrants because they do try to trick people with ICE warrants that are not valid. Don't let them into your home or place of business. \n\nThere are ICE agents that have and will pose as police officers, pretend to be part of specific precincts, etc. Approach EVERYTHING with caution. \n\nAnd just please be kind to one another right now.\n\nEdit from anyjane21: Judicial warrants will be signed by a judge and says United States District Court at the top. \nWhen reviewing warrants-details matter, pay attention to the date, time, and place the warrant specifies. \n\nThe National Immigrant Legal Center has information  on determining the differences between judicial and administrative warrants. https://www.nilc.org/wp-content/uploads/2020/09/Warrants-Subpoenas-Facts.pdf\n\nEdit from feelitrealgood: A handy guide to help prepare workplaces \n\nhttps://www.nilc.org/wp-content/uploads/2017/07/EmployerGuide-NELP-NILC-2017-07-1.pdf\n\n\nEdit 3: I am not arguing with you blockheads!! They arrested a veteran in our home state. They gave the okay to raid churches and daycares. You do not genuinely believe they're \"deporting dangerous criminals,\" and if you do, I have some goddamn snake oil to sell you. Argue with your mother because I am not the one for your gullible, propaganda-stuffed gullets to be flapping at. Stay out my comments cuz all you’re getting from me is bullied.", "ICE was spotted in Vineland, NJ. To any people who might be at risk, be informed of where they are and where they are going. If you aren’t at risk, help your neighbors. Call out if you see anything suspicious, be informed because in this new world everyone must be informed. \n", " "], "upvote_ratio": [0.91, 0.96, 0.92, 0.77, 0.84, 0.73, 0.64], "url": ["https://reddit.com/r/newjersey/comments/1jmwcjz/concern_for_a_flemington_man_who_may_have_been/", "https://reddit.com/r/newjersey/comments/1jm6dk5/ice_arrests_owner_of_yaya_noodles_in_somerset/", "https://reddit.com/r/newjersey/comments/1ibmtbd/people_are_panicking_mayor_addresses_reports_of/", "https://reddit.com/r/newjersey/comments/1i8ub9i/ice_raid_locations_sticky_thread/", "https://reddit.com/r/newjersey/comments/1i8ho0j/ice_raids/", "https://reddit.com/r/newjersey/comments/1i70lue/sightings_in_nj/", "https://reddit.com/r/newjersey/comments/1e06wtj/ice_conducts_raids_in_princeton/"], "num_comments": [48, 113, 28, 100, 536, 100, 13], "id": ["1jmwcjz", "1jm6dk5", "1ibmtbd", "1i8ub9i", "1i8ho0j", "1i70lue", "1e06wtj"], "created_utc": ["2025-03-29 21:10", "2025-03-28 21:38", "2025-01-27 22:58", "2025-01-24 12:31", "2025-01-23 23:44", "2025-01-22 02:34", "2024-07-10 21:04"], "place": ["Flemington", "Skillman", "Paterson", "Neptune, New Brunswick, Paulsboro, Newark, Lakewood, Belmar", "Lakewood, Neptune, Long Branch, Belmar, New Brunswick, Pleasantville", "Vineland", "Princeton"], "who": ["Karim Daoud", "Owner of YaYa Noodles", "N/A", "Various", "N/A", "N/A", "N/A"], "when": ["2025-03-29 21:10", "2025-03-28 21:38", "2025-01-27 22:58", "2025-01-24 12:31", "2025-01-23 23:44", "2025-01-22 02:34", "2024-07-10 21:04"]}