{"title": ["Concern for a Flemington man who may have been detained by ICE", "ICE Arrests Owner Of YaYa Noodles In Somerset County", "Urgent Housing Assistance & Free Legal Resources in NJ?", "Sad experience in Supercuts exposing our country's racism", "Newark residents protest reopening of ICE detention center", "Fuera ICE Protest at Delaney Hall. Newark, NJ 3.11.2025", "Who should I support for Governor: Ras Baraka or Steve Fulop?", "ICE Out of New Jersey- No Detention Camp in Newark", "Mayor Baraka is Standing Up To ICE!", "Amid community outcry, ICE releases statement on arrests of N.J. restaurant owners", "3/3 Protest Outside NJ's Only ICE Detention Center-Elizabeth, NJ", "Where are the organized political action groups in New Jersey?", "Newark Mayor Ras Baraka's response to the ICE detention center at Delaney Hall", "ICE announces opening of detention center in Newark, its first under Trump", "ICE arrests Jersey Kebab owners; neighbors start GoFundMe", "Cape May sheriff urges more local cooperation with ICE: NJ association president said he wants to get the 'bad actors' who could do harm", "NJ restaurant goes viral on TikTok for ICE raid that never happened", "ICE # - what is it?", "N.J. teachers wear ‘Gulf of America’ shirts to school. Controversy ensues.", "West NY restaurant owner says fake video of ICE raid at establishment is scaring customers away", "NJ people, if you really care about the US and its greatness, PLEASE read this post.", "200+ show up in solidarity with the NAACP before the Hunterdon County Board of Commissioners with a resolution to restrict ICE to its legal powers within its borders.", "If you are ever harassed by people pretending to be LEO or ICE....", "Immigration and Fast Facts and Resources", "Newark building could house ICE detainees if it reopens after a lawsuit against NJ", "Can we post helpful ICE infographics / info in this thread so that they can be accessed and easily shareable all in one place?", "'People Are Panicking': Mayor Addresses Reports Of ICE Agents In Paterson", "Brick Town Council", "Sad that I even have to ask this, but do I need to start walking around with my passport?", "ICE Activity in West New York Amid New Executive Order", "Map of ICE sightings", "Anti-Trump groups and protests", "Rats", "DCP&P posted illegal immigration policy.", "A map tracking ICE activity", "New Jersey officials condemn ‘egregious’ ICE raid that detained U.S. citizens and military veteran", "ICE in asbury park?", "This has to stop, Know your Rights and Limitations!", "How NJ Protects Itself from Bird Flu", "ICE Raid locations - sticky thread", "ICE Raids", "Mayor Ras J. Baraka’s statement on ICE raid on Newark business establishment", "NJ advises schools on how to protect students from ICE agents: Schools directed to do their best to keep immigrant students safe while complying with federal law", "New Jersey ICE Arrests Child Predators, Murderer, and More", "Sightings in NJ", "New Jersey Sanctuary State Policies At Risk After New ICE Directive Expands Reach of Agents", "F*ck Began county blue laws. ", "ICE conducts raids in Princeton", "Car Carrier Fire on 295"], "selftext": ["Just seeing a page on Facebook and an Instagram post today about a fellow called Karim Daoud who lives in Flemington who they say was apprehended by ICE. \n\nI just wondered if folks in the community are aware of this and have heard anything. I hope Karim and his family are OK. \n", " ", "\nHey everyone,\n\nI’m in a tough spot and looking for any organizations or programs in NJ that help with housing assistance. I recently applied for Temporary Disability (TDI) (and likely need to apply for SDI), and General Assistance (GA), but I have no income right now, run out of my savings, and can’t cover my $1,700 rent due in 9 days. \n\nI’m worried about becoming homeless if I can’t find help soon. Are there any emergency rental assistance programs, shelters, or immigrant friendly nonprofits in NJ that can help people in my situation?\n\nAdditionally, I have my mother with me who is 70 years old and been waiting for her papers over 3 years now. I brought her here when I was healthy and had great income in tech. But now she turned into my caregiver. And I’m also worried about her getting flagged by ICE too. \n\nI’d really appreciate any leads and urgent housing support. Thanks in advance! ", " Went to get a haircut this morning at Supercuts in *North Jersey (because I'm a high roller like that😇). Walked in and there were 2 elderly Spanish ladies working there & I was the only customer, so she took me right away. \n\nFor context Im a 50 yr old very white dude. Anyway, throughout the haircut the ladies were chatting back-and-forth mostly in Spanish about whatever.  My Spanish is admittedly pretty rudimentary but at one point, one of the ladies said, \"we shouldn't be talking only in Spanish in front of him\". Then the other lady said in English to me, \"sorry we're speaking Spanish to each other\" & it broke my heart.\n\nI said I don't mind whatsoever and I envy that you can speak both languages so fluently as you must be very bright to do that. I also said you should never be ashamed to speak your native tongue, no matter what our current political climate is like in this country and they just smiled meekly.\n\n  I could tell both ladies were very uncomfortable because they didn't know me from Adam, but they're obviously feeling the pressure of being an immigrant in a hostile country. \n\nHow truly sad our country has become where two co-workers can't converse in their native tongue without fear of some racist calling ICE on them or whatnot.....BTW, got a great haircut!!", " ", " ", "Hi everyone,\n\nI know the primary is still three months away but I am a bit torn on who to support in the upcoming Democratic gubernatorial primary. The two candidates that stick out to me are Steve Fulop and Ras Baraka. I like Fulop a lot because he is very ambitious on public transportation, particularly expanding the Hudson-Bergen Light Rail into Bergen County (I live in one of the communities that it's supposed to go through and am frustrated by its delay, so this is an issue that speaks to me deeply.)  This, and Steve's outward attacks against the NJ political machine show me that he has good political instincts and is offering the transformative change this state desperately needs. \n\nHowever, I've also grown very fond of Ras Baraka and his very belligerent approach to the Trump administration. Whether it is directly decrying the ICE raids in his city or seeking to prevent the ICE detention facility from re-opening in Newark, his fiery rhetoric and commitment towards the Democratic platform at a time when federal-level Democrats have been meek and cowardly in the face of Trump really resonates with me. He's energized me listening to his speeches and seeing the actions he's taken as of late.\n\n  \nI suppose this is a good problem to have as I like both these candidates, but I'm still torn on who I should ultimately vote for in the primary.  If anyone has any suggestions, please let me know!", "On **Tuesday, March 11th, at 12:00 p.m.** please join leading immigrant justice organizations in a mass demonstration against the plan to reopen Delaney Hall as an ICE jail.\n\nThis week has had incredible momentum between a demonstration at Elizabeth Detention Center and a multi-mile march of faith leaders in Newark. We're now bringing the energy to Delaney Hall to reject the mass deportation agenda and affirm our position against immigration detention.\n\n**When:** Tuesday, March 11th, 12:00 p.m.  \n**Where:** Delaney Hall, 451 Doremus Ave, Public Sidewalk  \n**Who:** Advocates, families affected by detention, YOU!\n\nAs if locking up community members for profit wasn't bad enough- the site of this for-profit jail is in the middle of what Newarkers know as \"chemical corridor\". It sits on a property that is deed restricted because of past environmental contamination.\n\nhttps://preview.redd.it/9mz65onokbne1.jpg?width=1545&format=pjpg&auto=webp&s=4f208ea39243bb9c92c91c8971000f308f28fafe\n\n", " ", " ", "Tomorrow (Monday) at noon folks will gather in front of NJ's only ICE detention center- 625 Evans St in Elizabeth. As you could expect it has become overcrowded and the conditions, which were always horrible have become horrific (it's a converted warehouse after all). They include spoiled food, Tylenol as one of the only dispensed medicines and a lack of clean drinking water. NJ passed a law in 2021 to close this place down but the private prison that operates the place is fighting NJ in court. Another private prison company, GEO Group, wants to open another one 3 times the size in Newark. The thing is- the more local detention space ICE has- the more arrests they can make. \n\nNJ residents were clear when we lobbied for our anti-ICE detention law. We don't want any of these places in our state!", "In the last few months I've been getting involved with a few national groups protesting the actions in DC.   As part of this, I'm landing on emails for groups that are locally involved, predominantly in Virginia, New York, and Pennsylvania.  \n\nHowever, it isn't like New Jersey isn't being affected, with the ICE detention center planned in Newark, our diverse immigrant community, and major cuts in federal funding of social programs, and ....I can go on.  We also have an important Gubernatorial election coming up this year.\n\nWhen I look at Mobilize and Indivisible, I really can't find anything really organized in central New Jersey.  A few, in places like Monmouth and Trenton, seem to exist only by legacy - and are oriented more to get out the vote (still important) than actual political action.   \n\nI'm being told over and over, start your own group - something much easier said than done - but, I can't believe there aren't any local chapters of major organizations who could benefit from numbers, including just having people to strategically attend state, county, and city meetings to make sure our rights are not being undermined.", "Slightly relieved after seeing that other post earlier, but a little worried about what he means by \"at this time\"\n\nA protest outside of Delaney Hall should still be organized, ideally on a weekend. 3/8?", "Privately-owned. ", " ", " ", " ", "Does anyone know what the ICE # means under inmate information? Only some people have it, most don’t. It’s alphanumeric 4 digits. ", "The shirts were worn during a dress-down day Jan. 31 at Belleville High School.\n\nThe T-shirts apparently referenced an executive order from President Donald Trump to rename the Gulf of Mexico, the Gulf of America. Some say the move has caused tension with the largely Latino school community.\n\nAnother teacher at Belleville High School took to social media to denounce what she called an attempt to bully Latino students who fear Trump’s threatened Immigration and Customs Enforcement raids.\n\n“Our student body has been suffering, crying, coming into school, emails from kids saying their parents are not letting come back for fear that they get picked up by ICE raids,” the Belleville teacher said in the post. “Our job is to support these kids and reassure them the school is safe place and to come here. I feel as if those t-shirts at Belleville High School are sending a clear-cut message to these kids in order to intimidate them and to bully them.”\n\nBelleville High School is 73% Hispanic, according to the latest state Department of Education data.", " ", "I am an immigrant (thankfully not the one ICE is interested in) and a scientist in industry.\n\nWe live in a quite uncertain time, and I am admittedly a lot more unnerved now that I ever was in 2016-2020. I see a lot of posts across Reddit about anti ICE/pro-DACA protests. That's great and all, but as someone who is more familiar with immigration laws, the chance is that none of these will actually help us or them. Also, *ICE has no realistic manpower to actually deport all the illegal immigrants.* DHS and USCIS data shows that the removal number in January 2025 is *lower* than that of Biden or Obama administration. Calling state reps or senates don't do anything.\n\nBut there are issues that you may actually influence.\n\nAs a scientist in the industry, my colleagues and I *heavily rely on* academia. I m sure folks like me know already but industry research is mostly for profits, while academic research is for knowledge. We cannot exist without the each other. Forget about the \"BIG PHARMA\" or \"EVIL CHEMICAL\" for a second. The current administration, mostly by DOGE, is single handedly attempting, and more effectively than the last term. damaging very important government agencies: NIH, NSF, FDA, NASA.\n\nNIH is the core public health and medical research agency with its origin from **1887**, and it is a huge agency that deals with every aspect of government research: funding, travel, conference, regulation, grant review, everything you can imagine. For reasons that we still don't know (well we do know, it's part of Project 2025 to dismantle federal government, but it doesn't benefit Americans regardless where you come from), NIH has been the first target of DOGE and **they froze grants, loans, communications, all suspensions of meetings and conferences, travels, meaning that all staff members are essentially forced to half their work entirely. Hiring freezing and communication freezing isn't abnormal, but a total halting of the financial aspects is extreme if not completely unheard of.  They are also threatening to mass-lay off the NIH workers (https://www.eenews.net/articles/science-funding-agency-threatened-with-mass-layoffs/)**\n\nSimilar thing is happening to NSF, National Science Foundation. **In fact, they have recently release a list of words that will cause a grant revoke (see here** https://www.reddit.com/r/labrats/comments/1ih8kp3/list\\_of\\_banned\\_words\\_being\\_sent\\_to\\_nsf\\_pos/). The majority the words are very common apolitical descriptions that the administration deems to \"woke\" for them. The salary payments for NSF has restored, but the concern still persists.\n\nFDA also has become a target, the agency that is relevant to you so that you can safely eat food from walmart that was shipped several hundred to thousand miles away from your home....things we take for granted. **Phyllis Fong, the inspector general of the US Department of Agriculture, was forcibly removed from her office in January 2025 after refusing to accept a termination notice from the Trump administration during the investigation into Neuralink's data protection and quality control. (https://economictimes.indiatimes.com/news/international/us/elon-musks-foe-phyllis-fong-who-was-investigating-his-brain-implant-startup-neuralink-forcefully-removed-from-office-after-refusing-to-comply-with-the-conditions-of-her-termination/articleshow/117744390.cms?from=mdr)**\n\nThese are just a few issues, and there are other agencies like DOE, SSA and USAID that DOGE seemingly has extremely questionable accesses but I am not familiar with these agencies so I will just stop here. Despite what culture war vultures try to tell you, NIH and NSF are extremely important bastion of knowledge and research that contributed to the US' scientific prowess. In fact, NIH GENERATERS **2.47$ per 1$ SPENT!** So the typical \"money bleeding argument' doesn't even fit here. FDA deregulation will further potentially endanger the consumers even more by allowing unscrupulous companies to declare untested, unverified claims to swindle everyone.\n\nIf I *sound* alarmist, that's cool. But these strategic destabilization of greatest federal agencies will damage American's reputation as a powerhouse of science and its overall global standing, and subsequently higher education and innovation. IT WILL NOT BENEFIT ANYBODY. This is not an issue of left and right. \n\nWrite and call your state rep and senates. Anybody. Of all the crazy things that the Trump administration will do, these will be *the* worst.", "\nHunterdon County is the red heart of District 7, which flipped to Republican Tom Kean Jr. in 2022, but described by one eloquent speaker tonight, \"bleeds red, blue, purple.\"\n\nI may have been in the courthouse as a friend who saw a flyer on Instagram, so I don't know how we all got there, but I do know that we all did! Every age, every party, every demographic that exists in one of the most diverse states in America, crammed into a hallway that definitely wasn't meant to hold all of us. Personally, I've mostly seen the courthouse from the street-- its giant steps and stone pillars are memorable even if you're not from Flemington.\n\nAs testified tonight by Mayor Baraka of Newark, ICE raids in Newark have resulted in the unlawful detention of U.S citizens, including a war veteran who was harassed by agents before being released. ICE has continued to close in the area, with known checkpoints like nearby Manville and South Plainfield in Somerset County common targets. The resolution proposed tonight demonstrates Hunterdon County's commitment to restricting ICE to its legal powers such as residents not being subjected to unlawful search and seizure.\n\nI'll disclaim here that I'm not a speaker for the NAACP, nor did I even get a chance to read the resolution tonight-- but what I did get a chance to see was the power in my community. At least two dozen speakers stood up tonight, some prepared, some not, yet every single one concerned with what our country is starting to look like. Business owners. Charity organizers. Veterans. Judges. Students. Teachers.\n\nAs others have said tonight-- the resolution being passed is an extremely low bar. Being one of the safest counties in the United States makes it lower. All that's being asked of our representatives is to hold ICE accountable; yet the fact that we have to do so when the real criminals are stealing secure data off of Treasury servers makes it necessary.\n\nThe least we can do is send a message to people beyond our local level that no one is immune to the law-- and even we can agree on that.", "If you don't look \"right\" and some people pretend to be ICE agent or any other law enforcement agents such as CBP, know the following: \n\n1. under N.J. Stat. § 2C:28-8, a. Except as provided in subsection b. of this section, **a person commits a disorderly persons offense if he falsely pretends to hold a position in the public service with purpose to induce another to submit to such pretended official authority or otherwise to act in reliance upon that pretense.**\n\nb. A person commits a crime of the fourth degree if he falsely pretends to hold a position as an officer or member or employee or agent of any organization or association of law enforcement officers with purpose to induce another to submit to such pretended official authority or otherwise to act in reliance upon that pretense.\n\nThe fines can be as low as 1,000, and as high as 10,000 with max 6 month prison time. \n\nThere are crazy people out there who are neither smart nor dedicated enough to actually be a federal LEO but want to LARP as one to exercise nonexistent power over people like us. Be *correctly* informed, and minimize damages. ", "All,\n\n\n\nI am a faith leader in Camden, NJ working alongside advocacy organizations regarding immigration and policy. Last night, January 27, 2025, a community forum was held at Camden City Hall regarding recent executive orders and how faith communities, advocacy groups, and nonprofits can support immigrants. What follows is what was relayed to the attendees by advocates and representatives of immigrants. This is not exhaustive and continues to change as more policies are enacted by the day. Also, this is from Camden and therefore resources may vary. For those not in Camden, I encourage you to reach out to the affiliate resources in your nearest large cities such as Trenton, New Brunswick, and Newark. \n\n\n\nTHIS IS NOT LEGAL ADVICE. THIS IS TO HELP US ALL LEARN. PLEASE READ IT ALL.\n\n\n\nMoving Forward:\n\n\n\n* Continue Reporting Crimes\\*\\*\n   * There are protections in place to allow undocumented folks to report crimes that have been perpetrated against them. According to New Jersey’s Department of Law and Public Safety: “In November 2018, the Attorney General issued the “Immigrant Trust Directive,” a landmark document designed to strengthen trust between law enforcement and the state's diverse immigrant communities. The Directive limits the types of voluntary assistance that New Jersey’s state and local law enforcement officers may provide to federal immigration authorities, including ICE, and emphasizes that New Jersey state, county, and local authorities are responsible for enforcement of criminal law, not federal civil immigration law. In doing so, the Directive makes clear that victims and witnesses can report crimes to law enforcement without fear that they will be turned over to federal immigration authorities.” \n   * Read More: [Immigrants' Rights in NJ](https://www.njoag.gov/programs/immigrants-rights/#:~:text=Ensuring%20immigrants%20feel%20safe%20interacting%20with%20local%20police.&text=In%20doing%20so%2C%20the%20Directive,over%20to%20federal%20immigration%20authorities.)\n* Mexican Citizens have the backing of the Mexican Consulate in Philadelphia 100%\n   * **Consulate of Mexico Phone:** [(215) 923-8384](https://www.google.com/search?gs_ssp=eJzj4tZP1zcsSa6IL640MWC0UjWosLBMNku2sDAxT0u2MEozsbQyqEgzMUlJNUkzMk-xMEw0MknzkstNrchMTsxTSM7PKy7NSSxJVSjIyMxJTEnNAdKJAC7lGxY&q=mexican+consulate+philadelphia&rlz=1C1SQJL_enUS884US884&oq=Mexican+Consulate&gs_lcrp=EgZjaHJvbWUqEAgBEC4YrwEYxwEYgAQYjgUyDQgAEAAYgwEYsQMYgAQyEAgBEC4YrwEYxwEYgAQYjgUyDQgCEAAYgwEYsQMYgAQyBwgDEAAYgAQyEwgEEC4YgwEYrwEYxwEYsQMYgAQyBwgFEAAYgAQyBwgGEAAYgAQyDQgHEC4YrwEYxwEYgAQyEwgIEC4YgwEYrwEYxwEYsQMYgAQyDQgJEC4YrwEYxwEYgATSAQg2NDQzajBqN6gCALACAA&sourceid=chrome&ie=UTF-8#)\n* Get Papers in Order\n   * ID’s…If you do not have an ID and are able to obtain one, *GET ONE.* Part of the problem is this: US Citizens are having their citizenship questioned based on their cultural background, appearance, and language. The more proof you have, the less ICE can use against you. \n   * If you are undocumented and are able to get proper documentation *GET IT NOW. DO NOT WAIT.*\n\n\n\nFour Asks of the Immigrant Advocacy Community\n\n\n\n1. Support victims of crimes (via proper supporting and mutual aid/established non-profits, etc.)\n2. For schools to protect immigrant students walking to and from school.\n3. Prohibit local law enforcement from working with ICE.\\*\\*\n4. Attend and assist in disseminating accurate information about knowing your rights. \n\n\n\n\\*\\*On Law Enforcement and New Jersey’s Immigrant Trust Directive (ITD)\\*\\*\n\n\n\nBecause of NJ’s Immigrant Trust Directive, (“ITD”) it is less likely that local law enforcement will accompany ICE on raids. In 2018, the AG issued the ITD to strengthen trust between law enforcement and NJ’s diverse immigrant communities. The Directive is designed to ensure that, regardless of their immigration status, victims and witnesses feel safe reporting crimes to the local police. It therefore limits state and local cooperation with ICE.\n\n  \n\n\nOne of the key asks from the immigrant advocacy community is this: DO NOT speculate about ICE. Spreading roomers is damaging the response to organize. Also, Advocates want immigrants to still report crimes. Fear is the biggest hindrance. This is understandable, but we do not want to cause excessive rumors as they are ultimately draining on resources and efforts. \n\n\n\nAction Steps: \n\n1. Write your state representatives to support the asks of the immigrant community here in New Jersey, as well as your federal officials. \n\n2. Pray without ceasing. I don't care if you are Christian or not, religious or otherwise. Lift one up for our neighbors in danger and all involved in caring for our neighbors. \n\n(Re)Sources:\n\n\n\nImmigrant Trust Directive in the State of New Jersey: \n\n[https://search.app/DBwxj7FuDvk4J5AGA](https://search.app/DBwxj7FuDvk4J5AGA)\n\n\n\nLowenstein Center for the Public Interest and Immigrant Advocates: [https://search.app/RAusx8Da8sf7UvCu7](https://search.app/RAusx8Da8sf7UvCu7) \n\n\n\n[Immigrants’ Rights - New Jersey Office of Attorney General](https://www.njoag.gov/programs/immigrants-rights/#:~:text=Ensuring%20immigrants%20feel%20safe%20interacting%20with%20local%20police.&text=In%20doing%20so%2C%20the%20Directive,over%20to%20federal%20immigration%20authorities). \n\n\n\nBlessings on your work, and may you all find rest and peace amid this chaos. \n\n\n\nPeace +\n\n\n\ntherevvedreverend\n\nEdit: phrasing/clarity.", " ", "I'm not looking for their locations but more so I can send info around to those I know who work in restaurants etc.\n\nI saw a few good infographics and can't seem to find them now. ", " ", "Is anybody else planning on attending this week's town council meeting in BrickTownship? I would like to go tomorrow night and give the council a chance to provide their plans for how they're going to keep ICE out of our local schools.  I would like to know if I am going to have supporters in the crowd who agree and could possibly stand behind me as I address the council. All children deserve the right to a safe education environment,  not to be ripped from their desks and not to see their friends escorted from the classroom to be used as bait! All children will be affected and it's important that we stand together and show up on the local levels to let town officials and school board members know we will be holding them responsible.  ", "I’m American born and raised, ethnically East Asian and often get mistaken as Hispanic for having a darker skin tone.\n\nWith all this news of ICE sightings and them detaining individuals based on racial profiling, do I need to start walking around with my passport to prove I’m a US Citizen?", " ", "Chingar la migra!  Protect your neighbors!\n", "What is the best way to get involved in anti-Trump activism here in NJ? I’m revolted by Trump and am particularly horrified by the recent ICE raids in Newark. \n\nIs there any network I can join that will keep me updated on protests I could attend? Any good organizations come to mind? Particularly in Central NJ. ", "So everything I've read about the recent ICE raid was that it was in response to a tip.\n\nAny of you internet geniuses know how to find rats?", "Child protective services policy on illegal immigrants. Basically if detained by ICE - if a child is a citizen DCPP takes custody of the child. If 15 non-consecutive months pass by with the child in placement the U.S. citizen child will be moved towards adoption.\n\n", "Add updates re ICE activity in NJ here: [https://padlet.com/bebe050420/chismosas-sightings-anonymous-an-nimo-lf0l47ljszbto2uj?fbclid=PAZXh0bgNhZW0CMTEAAabqyAl1DPk8YwEGhHGhus-0NkH5uz8z\\_bj46u21We4bf9YYaoRSqS8el\\_s\\_aem\\_HX5BnYVjfUvUGSsMthJcXw](https://padlet.com/bebe050420/chismosas-sightings-anonymous-an-nimo-lf0l47ljszbto2uj?fbclid=PAZXh0bgNhZW0CMTEAAabqyAl1DPk8YwEGhHGhus-0NkH5uz8z_bj46u21We4bf9YYaoRSqS8el_s_aem_HX5BnYVjfUvUGSsMthJcXw)", " ", "I work in public service for a non profit. I am hearing RUMORS that ICE is in Asbury Park. Can anybody confirm?", "I've lived in the US my entire life. I'm one of those stories of immigrant parents taking their child to start a new life in a new country. I have experienced first hand the difficulties undocumented immigrants face everyday and the negative political discourse the nation has about us lately. I don't endorse criminal activity of any type. For some reason Americans think undocumented people represent a considerable percentage of felonies across the country when, in reality, it's the opposite. Verify [here](https://nij.ojp.gov/topics/articles/undocumented-immigrant-offending-rate-lower-us-born-citizen-rate).\n\nI don't like to get into political stuff, but we all know the new administration represents questionable values regarding our community. Don't let this rhetoric diminish your value. Media and ignorant people will polarize our role in society, making you think \"you're not enough for the American nation\". Aside from employers exploiting workers with minimum wages for hard labor, they see no other contribution of the undocumented community in society.\n\nI acknowledge not everyone thinks this way. In fact, a small percentage of Americans do, but they are noisy and hateful. We know our situation and do our best to contribute, we have ITIN numbers to report our taxes, drive vehicles with lawfully issued licenses, create businesses with EIN and compliance paperwork, speak English fluently and don't abuse state and federal programs like food stamps (I hope you're not abusing it, don't be part of the problem).\n\nThe majority of us didn't choose to be in this position. ICE targeting workplaces, churches, and schools is a poor execution of wiping out undocumented criminals, they just simply don't hang out there. We have to be cautious, know your rights clearly and exercise Miranda rights when necessary. Read and carry a copy of the constitution. You're living in the US regardless of status, so you should make an effort to understand the system and law, no exceptions. Also, while we are still protected in some areas, we're not in others, I highly recommend read [this](https://www.fuchsberg.com/blog/illegal-immigrants-rights) and expand from there.\n\nI recognize the challenges in our current position. As anything in life, knowledge and a solid mindset is necessary for success. Be mindful of your actions and stay away from law enforcement (in the positive and protection sense). We need accurate and reliable information, and for most cases executive orders can be exercised only on the scope of the current law and require a rigorous process to modify the constitution. In an unbiased manner, question everything this or other administrations propose regarding policy of any type just like the ridiculous, racist and unproductive allocation of mental energy of the birthright citizenship executive order. Read the order [here](https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/) and an objective analysis [here](https://www.thenation.com/article/politics/trump-birthright-citizenship-executive-order/).\n\nAnonymously written at my discretion.\n\nEdit: I wasn’t expecting such traction. I’ll answer your comments, but first, let me clarify: I wrote this in reaction to the latest news and events surrounding this topic, so it has an emotional aspect, though I did my best to bring objectivity.\n\nOne additional point I didn’t discuss is that undocumented immigrants are unfortunately negatively impacted by the actions of gangs and terrorist groups within the country. We want those groups out as much as you do. This isn’t an easy task to accomplish, as there are many collateral effects that impact the immigrant community. The real problem has historic roots, such as the stigmatization of Italian and Chinese immigrants in the 19th and 20th centuries due to mafia and illegal activity. A small subgroup of immigrants acting unlawfully creates the perception that this is what to expect from the entire group.\n\nA contemporary example could be MS-13 or the current Train Aragua national threats (they must be wiped out asap). This issue has been weaponized by multiple political administrations throughout history, abusing the uninformed average American to gain votes.\n\nI’m against illegal immigration, but I sympathize with those who hold the right values, manage to cross the border, and strive to contribute to society within their limited legal scope. This topic is complex, and to avoid the abuse of the border, immigration systems should be properly established.\n\nI just think the conversation can quickly turn irrational when political ideologies obstruct objective points, and emotional reactions steer the discourse away from the core issue. ", "I know there's a whirlwind of panic surrounding the ICE raids, and with good reason. But I want to talk about a threat that's just as deadly- bird flu.\n\nTrump has ended the ability of relevant health agencies from communicating their research with the public, or even from engaging in that research in the first place. Let us be clear: we are not being left to die, they are trying to kill us from a distance. But New Jerseyans are tough gristly bastards. If we need to protect ourselves, we will.\n\nWhat are state-level resources people know of, that track bird flu? What agencies are doing research and sampling? How can we harden our communities against this next looming pandemic?", "Mods - can we please get a sticky going of where ICE raids have taken place to document these actions? We need a way to document where these have taken place. ", "I know a post about the one in Newark got a lot of attention, but I heard there were also raids in Vineland and East Brunswick. Exactly how true this is, I cannot say as of right now, so take it lightly, but stay alert nonetheless.\n\nMORE SIGHTINGS IN LAKEWOOD, NEPTUNE/ASBURY, LONG BRANCH, BELMAR AND NEW BRUNSWICK TRAIN STATION ( 1/24/25 )\n\nHOUSE TO HOUSE RAIDS IN PLEASANTVILLE, RIGHT OUTSIDE OF AC. ( 1/24/25 )\n\nSIGHTING AT RUTGERS NEW BRUNSWICK. ( 1/24/25 )\n\nPlease, please be careful, everyone. \n\nIf you have the ability to safely do so: Distract ICE agents. Don't do anything illegal or that will get you hurt, but waste their time if you can. \n\nRemember: Immigrant or not: YOU DO NOT NEED TO SPEAK WITH THEM. Don't speak without a lawyer present. Don't answer questions. Demand and verify real warrants because they do try to trick people with ICE warrants that are not valid. Don't let them into your home or place of business. \n\nThere are ICE agents that have and will pose as police officers, pretend to be part of specific precincts, etc. Approach EVERYTHING with caution. \n\nAnd just please be kind to one another right now.\n\nEdit from anyjane21: Judicial warrants will be signed by a judge and says United States District Court at the top. \nWhen reviewing warrants-details matter, pay attention to the date, time, and place the warrant specifies. \n\nThe National Immigrant Legal Center has information  on determining the differences between judicial and administrative warrants. https://www.nilc.org/wp-content/uploads/2020/09/Warrants-Subpoenas-Facts.pdf\n\nEdit from feelitrealgood: A handy guide to help prepare workplaces \n\nhttps://www.nilc.org/wp-content/uploads/2017/07/EmployerGuide-NELP-NILC-2017-07-1.pdf\n\n\nEdit 3: I am not arguing with you blockheads!! They arrested a veteran in our home state. They gave the okay to raid churches and daycares. You do not genuinely believe they're \"deporting dangerous criminals,\" and if you do, I have some goddamn snake oil to sell you. Argue with your mother because I am not the one for your gullible, propaganda-stuffed gullets to be flapping at. Stay out my comments cuz all you’re getting from me is bullied.", "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment?fbclid=IwY2xjawH_n-VleHRuA2FlbQIxMQABHX3M9UukYfd2O5K-LAV9z-9opZ5hxi6M_6xsUcP5wc6alSzogecZteIOTw_aem_Ej7j3m3JWHjDdwFZxYyMSQ ", " ", " ", "ICE was spotted in Vineland, NJ. To any people who might be at risk, be informed of where they are and where they are going. If you aren’t at risk, help your neighbors. Call out if you see anything suspicious, be informed because in this new world everyone must be informed. \n", " ", "Today, a Sunday, I couldn’t buy ICE CUBE TRAYS at the grocery store. Is there something wrong with these people? Back to Essex where I belong. ", " ", "Can anybody clarify what vehicles were on that carrier? NJ 101.5 was quick to say EV/hybrid vehicles, but they all looked like ICE Grand Cherokees and a Wrangler."], "upvote_ratio": [0.91, 0.96, 0.71, 0.44, 0.87, 0.64, 0.63, 0.85, 0.86, 0.97, 0.78, 0.76, 0.95, 0.96, 0.9, 0.86, 0.87, 0.4, 0.94, 0.92, 0.88, 0.91, 0.78, 0.66, 0.42, 0.55, 0.92, 0.61, 0.78, 0.87, 0.78, 0.76, 0.33, 0.7, 0.79, 0.92, 0.65, 0.83, 0.89, 0.77, 0.84, 0.95, 0.92, 0.23, 0.73, 0.91, 0.44, 0.64, 0.5], "url": ["https://reddit.com/r/newjersey/comments/1jmwcjz/concern_for_a_flemington_man_who_may_have_been/", "https://reddit.com/r/newjersey/comments/1jm6dk5/ice_arrests_owner_of_yaya_noodles_in_somerset/", "https://reddit.com/r/newjersey/comments/1jfjl5c/urgent_housing_assistance_free_legal_resources_in/", "https://reddit.com/r/newjersey/comments/1jbb5pz/sad_experience_in_supercuts_exposing_our_countrys/", "https://reddit.com/r/newjersey/comments/1j9tm88/newark_residents_protest_reopening_of_ice/", "https://reddit.com/r/newjersey/comments/1j99kz1/fuera_ice_protest_at_delaney_hall_newark_nj/", "https://reddit.com/r/newjersey/comments/1j943i9/who_should_i_support_for_governor_ras_baraka_or/", "https://reddit.com/r/newjersey/comments/1j5xqif/ice_out_of_new_jersey_no_detention_camp_in_newark/", "https://reddit.com/r/newjersey/comments/1j52673/mayor_baraka_is_standing_up_to_ice/", "https://reddit.com/r/newjersey/comments/1j2nawz/amid_community_outcry_ice_releases_statement_on/", "https://reddit.com/r/newjersey/comments/1j253qk/33_protest_outside_njs_only_ice_detention/", "https://reddit.com/r/newjersey/comments/1j0drkz/where_are_the_organized_political_action_groups/", "https://reddit.com/r/newjersey/comments/1izu8ta/newark_mayor_ras_barakas_response_to_the_ice/", "https://reddit.com/r/newjersey/comments/1iznkc1/ice_announces_opening_of_detention_center_in/", "https://reddit.com/r/newjersey/comments/1iyurco/ice_arrests_jersey_kebab_owners_neighbors_start/", "https://reddit.com/r/newjersey/comments/1ip0xz9/cape_may_sheriff_urges_more_local_cooperation/", "https://reddit.com/r/newjersey/comments/1imae4o/nj_restaurant_goes_viral_on_tiktok_for_ice_raid/", "https://reddit.com/r/newjersey/comments/1ikfs3n/ice_what_is_it/", "https://reddit.com/r/newjersey/comments/1ik0ln0/nj_teachers_wear_gulf_of_america_shirts_to_school/", "https://reddit.com/r/newjersey/comments/1ij41y9/west_ny_restaurant_owner_says_fake_video_of_ice/", "https://reddit.com/r/newjersey/comments/1ij3xsw/nj_people_if_you_really_care_about_the_us_and_its/", "https://reddit.com/r/newjersey/comments/1ii2z66/200_show_up_in_solidarity_with_the_naacp_before/", "https://reddit.com/r/newjersey/comments/1ieto4d/if_you_are_ever_harassed_by_people_pretending_to/", "https://reddit.com/r/newjersey/comments/1iceejp/immigration_and_fast_facts_and_resources/", "https://reddit.com/r/newjersey/comments/1ic5dr9/newark_building_could_house_ice_detainees_if_it/", "https://reddit.com/r/newjersey/comments/1ic4s9q/can_we_post_helpful_ice_infographics_info_in_this/", "https://reddit.com/r/newjersey/comments/1ibmtbd/people_are_panicking_mayor_addresses_reports_of/", "https://reddit.com/r/newjersey/comments/1ibgie1/brick_town_council/", "https://reddit.com/r/newjersey/comments/1iajpzc/sad_that_i_even_have_to_ask_this_but_do_i_need_to/", "https://reddit.com/r/newjersey/comments/1i9s09p/ice_activity_in_west_new_york_amid_new_executive/", "https://reddit.com/r/newjersey/comments/1i9np86/map_of_ice_sightings/", "https://reddit.com/r/newjersey/comments/1i9god0/antitrump_groups_and_protests/", "https://reddit.com/r/newjersey/comments/1i9c9xg/rats/", "https://reddit.com/r/newjersey/comments/1i995nx/dcpp_posted_illegal_immigration_policy/", "https://reddit.com/r/newjersey/comments/1i98087/a_map_tracking_ice_activity/", "https://reddit.com/r/newjersey/comments/1i9303e/new_jersey_officials_condemn_egregious_ice_raid/", "https://reddit.com/r/newjersey/comments/1i8zpx2/ice_in_asbury_park/", "https://reddit.com/r/newjersey/comments/1i8vs57/this_has_to_stop_know_your_rights_and_limitations/", "https://reddit.com/r/newjersey/comments/1i8ui1j/how_nj_protects_itself_from_bird_flu/", "https://reddit.com/r/newjersey/comments/1i8ub9i/ice_raid_locations_sticky_thread/", "https://reddit.com/r/newjersey/comments/1i8ho0j/ice_raids/", "https://reddit.com/r/newjersey/comments/1i8fv2o/mayor_ras_j_barakas_statement_on_ice_raid_on/", "https://reddit.com/r/newjersey/comments/1i8b5ys/nj_advises_schools_on_how_to_protect_students/", "https://reddit.com/r/newjersey/comments/1i84jwe/new_jersey_ice_arrests_child_predators_murderer/", "https://reddit.com/r/newjersey/comments/1i70lue/sightings_in_nj/", "https://reddit.com/r/newjersey/comments/1i6nwyn/new_jersey_sanctuary_state_policies_at_risk_after/", "https://reddit.com/r/newjersey/comments/1gdne4m/fck_began_county_blue_laws/", "https://reddit.com/r/newjersey/comments/1e06wtj/ice_conducts_raids_in_princeton/", "https://reddit.com/r/newjersey/comments/10jkmgb/car_carrier_fire_on_295/"], "num_comments": [48, 113, 2, 36, 1, 1, 83, 112, 23, 107, 17, 35, 139, 221, 41, 57, 3, 0, 256, 20, 124, 3, 19, 2, 4, 0, 28, 1, 266, 8, 19, 221, 3, 18, 8, 36, 49, 45, 44, 100, 536, 304, 41, 9, 100, 181, 51, 13, 10], "id": ["1jmwcjz", "1jm6dk5", "1jfjl5c", "1jbb5pz", "1j9tm88", "1j99kz1", "1j943i9", "1j5xqif", "1j52673", "1j2nawz", "1j253qk", "1j0drkz", "1izu8ta", "1iznkc1", "1iyurco", "1ip0xz9", "1imae4o", "1ikfs3n", "1ik0ln0", "1ij41y9", "1ij3xsw", "1ii2z66", "1ieto4d", "1iceejp", "1ic5dr9", "1ic4s9q", "1ibmtbd", "1ibgie1", "1iajpzc", "1i9s09p", "1i9np86", "1i9god0", "1i9c9xg", "1i995nx", "1i98087", "1i9303e", "1i8zpx2", "1i8vs57", "1i8ui1j", "1i8ub9i", "1i8ho0j", "1i8fv2o", "1i8b5ys", "1i84jwe", "1i70lue", "1i6nwyn", "1gdne4m", "1e06wtj", "10jkmgb"], "created_utc": ["2025-03-29 21:10", "2025-03-28 21:38", "2025-03-20 07:40", "2025-03-14 18:50", "2025-03-12 20:12", "2025-03-12 03:08", "2025-03-11 22:51", "2025-03-07 19:28", "2025-03-06 18:21", "2025-03-03 16:56", "2025-03-02 23:46", "2025-02-28 17:52", "2025-02-27 23:53", "2025-02-27 19:02", "2025-02-26 18:40", "2025-02-14 03:01", "2025-02-10 16:38", "2025-02-08 05:13", "2025-02-07 17:33", "2025-02-06 14:41", "2025-02-06 14:35", "2025-02-05 05:29", "2025-02-01 00:17", "2025-01-28 22:33", "2025-01-28 16:24", "2025-01-28 15:59", "2025-01-27 22:58", "2025-01-27 18:41", "2025-01-26 17:00", "2025-01-25 17:26", "2025-01-25 14:09", "2025-01-25 06:08", "2025-01-25 01:55", "2025-01-24 23:24", "2025-01-24 22:33", "2025-01-24 18:58", "2025-01-24 16:43", "2025-01-24 13:48", "2025-01-24 12:42", "2025-01-24 12:31", "2025-01-23 23:44", "2025-01-23 22:23", "2025-01-23 19:06", "2025-01-23 14:27", "2025-01-22 02:34", "2025-01-21 17:27", "2024-10-27 22:44", "2024-07-10 21:04", "2023-01-23 19:09"]}